zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K358_K348_K338_K328_289BGA-pinctrl.h
/* EMIOS_0 */
#define PTA0_EMIOS_0_CH17_Y_O                  NXP_SIUL2_PINMUX(0, 0, 0, 2, 0, 0)
#define PTA0_EMIOS_0_CH17_Y_I                  NXP_SIUL2_PINMUX(0, 0, 0, 0, 65, 2)
#define PTA1_EMIOS_0_CH9_H_O                   NXP_SIUL2_PINMUX(0, 0, 1, 2, 0, 0)
#define PTA1_EMIOS_0_CH9_H_I                   NXP_SIUL2_PINMUX(0, 0, 1, 0, 57, 1)
#define PTA10_EMIOS_0_CH12_H_O                 NXP_SIUL2_PINMUX(0, 0, 10, 2, 0, 0)
#define PTA10_EMIOS_0_CH12_H_I                 NXP_SIUL2_PINMUX(0, 0, 10, 0, 60, 2)
#define PTA11_EMIOS_0_CH13_H_O                 NXP_SIUL2_PINMUX(0, 0, 11, 2, 0, 0)
#define PTA11_EMIOS_0_CH13_H_I                 NXP_SIUL2_PINMUX(0, 0, 11, 0, 61, 1)
#define PTA12_EMIOS_0_CH14_H_O                 NXP_SIUL2_PINMUX(0, 0, 12, 2, 0, 0)
#define PTA12_EMIOS_0_CH14_H_I                 NXP_SIUL2_PINMUX(0, 0, 12, 0, 62, 1)
#define PTA13_EMIOS_0_CH15_H_O                 NXP_SIUL2_PINMUX(0, 0, 13, 2, 0, 0)
#define PTA13_EMIOS_0_CH15_H_I                 NXP_SIUL2_PINMUX(0, 0, 13, 0, 63, 2)
#define PTA15_EMIOS_0_CH10_H_O                 NXP_SIUL2_PINMUX(0, 0, 15, 2, 0, 0)
#define PTA15_EMIOS_0_CH10_H_I                 NXP_SIUL2_PINMUX(0, 0, 15, 0, 58, 2)
#define PTA16_EMIOS_0_CH11_H_O                 NXP_SIUL2_PINMUX(0, 0, 16, 2, 0, 0)
#define PTA16_EMIOS_0_CH11_H_I                 NXP_SIUL2_PINMUX(0, 0, 16, 0, 59, 2)
#define PTA17_EMIOS_0_CH6_G_O                  NXP_SIUL2_PINMUX(0, 0, 17, 2, 0, 0)
#define PTA17_EMIOS_0_CH6_G_I                  NXP_SIUL2_PINMUX(0, 0, 17, 0, 54, 2)
#define PTB0_EMIOS_0_CH3_G_O                   NXP_SIUL2_PINMUX(0, 0, 32, 4, 0, 0)
#define PTB0_EMIOS_0_CH3_G_I                   NXP_SIUL2_PINMUX(0, 0, 32, 0, 51, 4)
#define PTB1_EMIOS_0_CH7_G_O                   NXP_SIUL2_PINMUX(0, 0, 33, 4, 0, 0)
#define PTB1_EMIOS_0_CH7_G_I                   NXP_SIUL2_PINMUX(0, 0, 33, 0, 55, 3)
#define PTB2_EMIOS_0_CH8_X_O                   NXP_SIUL2_PINMUX(0, 0, 34, 2, 0, 0)
#define PTB2_EMIOS_0_CH8_X_I                   NXP_SIUL2_PINMUX(0, 0, 34, 0, 56, 1)
#define PTB3_EMIOS_0_CH9_H_O                   NXP_SIUL2_PINMUX(0, 0, 35, 2, 0, 0)
#define PTB3_EMIOS_0_CH9_H_I                   NXP_SIUL2_PINMUX(0, 0, 35, 0, 57, 2)
#define PTB4_EMIOS_0_CH4_G_O                   NXP_SIUL2_PINMUX(0, 0, 36, 2, 0, 0)
#define PTB4_EMIOS_0_CH4_G_I                   NXP_SIUL2_PINMUX(0, 0, 36, 0, 52, 1)
#define PTB5_EMIOS_0_CH5_G_O                   NXP_SIUL2_PINMUX(0, 0, 37, 2, 0, 0)
#define PTB5_EMIOS_0_CH5_G_I                   NXP_SIUL2_PINMUX(0, 0, 37, 0, 53, 1)
#define PTB12_EMIOS_0_CH0_X_O                  NXP_SIUL2_PINMUX(0, 0, 44, 2, 0, 0)
#define PTB12_EMIOS_0_CH0_X_I                  NXP_SIUL2_PINMUX(0, 0, 44, 0, 48, 1)
#define PTB13_EMIOS_0_CH1_G_O                  NXP_SIUL2_PINMUX(0, 0, 45, 2, 0, 0)
#define PTB13_EMIOS_0_CH1_G_I                  NXP_SIUL2_PINMUX(0, 0, 45, 0, 49, 2)
#define PTB14_EMIOS_0_CH2_G_O                  NXP_SIUL2_PINMUX(0, 0, 46, 2, 0, 0)
#define PTB14_EMIOS_0_CH2_G_I                  NXP_SIUL2_PINMUX(0, 0, 46, 0, 50, 3)
#define PTB15_EMIOS_0_CH3_G_O                  NXP_SIUL2_PINMUX(0, 0, 47, 2, 0, 0)
#define PTB15_EMIOS_0_CH3_G_I                  NXP_SIUL2_PINMUX(0, 0, 47, 0, 51, 1)
#define PTB16_EMIOS_0_CH4_G_O                  NXP_SIUL2_PINMUX(0, 0, 48, 2, 0, 0)
#define PTB16_EMIOS_0_CH4_G_I                  NXP_SIUL2_PINMUX(0, 0, 48, 0, 52, 2)
#define PTB17_EMIOS_0_CH5_G_O                  NXP_SIUL2_PINMUX(0, 0, 49, 2, 0, 0)
#define PTB17_EMIOS_0_CH5_G_I                  NXP_SIUL2_PINMUX(0, 0, 49, 0, 53, 2)
#define PTC0_EMIOS_0_CH0_X_O                   NXP_SIUL2_PINMUX(0, 0, 64, 2, 0, 0)
#define PTC0_EMIOS_0_CH14_H_O                  NXP_SIUL2_PINMUX(0, 0, 64, 6, 0, 0)
#define PTC0_EMIOS_0_CH0_X_I                   NXP_SIUL2_PINMUX(0, 0, 64, 0, 48, 3)
#define PTC0_EMIOS_0_CH14_H_I                  NXP_SIUL2_PINMUX(0, 0, 64, 0, 62, 2)
#define PTC1_EMIOS_0_CH1_G_O                   NXP_SIUL2_PINMUX(0, 0, 65, 2, 0, 0)
#define PTC1_EMIOS_0_CH15_H_O                  NXP_SIUL2_PINMUX(0, 0, 65, 6, 0, 0)
#define PTC1_EMIOS_0_CH1_G_I                   NXP_SIUL2_PINMUX(0, 0, 65, 0, 49, 1)
#define PTC1_EMIOS_0_CH15_H_I                  NXP_SIUL2_PINMUX(0, 0, 65, 0, 63, 1)
#define PTC2_EMIOS_0_CH2_G_O                   NXP_SIUL2_PINMUX(0, 0, 66, 2, 0, 0)
#define PTC2_EMIOS_0_CH2_G_I                   NXP_SIUL2_PINMUX(0, 0, 66, 0, 50, 2)
#define PTC3_EMIOS_0_CH3_G_O                   NXP_SIUL2_PINMUX(0, 0, 67, 2, 0, 0)
#define PTC3_EMIOS_0_CH3_G_I                   NXP_SIUL2_PINMUX(0, 0, 67, 0, 51, 3)
#define PTC4_EMIOS_0_CH8_X_O                   NXP_SIUL2_PINMUX(0, 0, 68, 2, 0, 0)
#define PTC4_EMIOS_0_CH8_X_I                   NXP_SIUL2_PINMUX(0, 0, 68, 0, 56, 2)
#define PTC5_EMIOS_0_CH16_X_O                  NXP_SIUL2_PINMUX(0, 0, 69, 2, 0, 0)
#define PTC5_EMIOS_0_CH16_X_I                  NXP_SIUL2_PINMUX(0, 0, 69, 0, 64, 2)
#define PTC10_EMIOS_0_CH6_G_O                  NXP_SIUL2_PINMUX(0, 0, 74, 1, 0, 0)
#define PTC10_EMIOS_0_CH6_G_I                  NXP_SIUL2_PINMUX(0, 0, 74, 0, 54, 4)
#define PTC12_EMIOS_0_CH22_X_O                 NXP_SIUL2_PINMUX(0, 0, 76, 3, 0, 0)
#define PTC12_EMIOS_0_CH22_X_I                 NXP_SIUL2_PINMUX(0, 0, 76, 0, 70, 2)
#define PTC13_EMIOS_0_CH23_X_O                 NXP_SIUL2_PINMUX(0, 0, 77, 3, 0, 0)
#define PTC13_EMIOS_0_CH23_X_I                 NXP_SIUL2_PINMUX(0, 0, 77, 0, 71, 1)
#define PTC14_EMIOS_0_CH10_H_O                 NXP_SIUL2_PINMUX(0, 0, 78, 2, 0, 0)
#define PTC14_EMIOS_0_CH10_H_I                 NXP_SIUL2_PINMUX(0, 0, 78, 0, 58, 1)
#define PTC15_EMIOS_0_CH11_H_O                 NXP_SIUL2_PINMUX(0, 0, 79, 2, 0, 0)
#define PTC15_EMIOS_0_CH11_H_I                 NXP_SIUL2_PINMUX(0, 0, 79, 0, 59, 1)
#define PTC22_EMIOS_0_CH8_X_O                  NXP_SIUL2_PINMUX(0, 0, 86, 1, 0, 0)
#define PTC22_EMIOS_0_CH8_X_I                  NXP_SIUL2_PINMUX(0, 0, 86, 0, 56, 3)
#define PTD0_EMIOS_0_CH2_G_O                   NXP_SIUL2_PINMUX(0, 0, 96, 2, 0, 0)
#define PTD0_EMIOS_0_CH16_X_O                  NXP_SIUL2_PINMUX(0, 0, 96, 4, 0, 0)
#define PTD0_EMIOS_0_CH2_G_I                   NXP_SIUL2_PINMUX(0, 0, 96, 0, 50, 1)
#define PTD0_EMIOS_0_CH16_X_I                  NXP_SIUL2_PINMUX(0, 0, 96, 0, 64, 1)
#define PTD1_EMIOS_0_CH3_G_O                   NXP_SIUL2_PINMUX(0, 0, 97, 2, 0, 0)
#define PTD1_EMIOS_0_CH17_Y_O                  NXP_SIUL2_PINMUX(0, 0, 97, 4, 0, 0)
#define PTD1_EMIOS_0_CH3_G_I                   NXP_SIUL2_PINMUX(0, 0, 97, 0, 51, 2)
#define PTD1_EMIOS_0_CH17_Y_I                  NXP_SIUL2_PINMUX(0, 0, 97, 0, 65, 1)
#define PTD5_EMIOS_0_CH19_Y_O                  NXP_SIUL2_PINMUX(0, 0, 101, 2, 0, 0)
#define PTD5_EMIOS_0_CH2_G_O                   NXP_SIUL2_PINMUX(0, 0, 101, 3, 0, 0)
#define PTD5_EMIOS_0_CH2_G_I                   NXP_SIUL2_PINMUX(0, 0, 101, 0, 50, 4)
#define PTD5_EMIOS_0_CH19_Y_I                  NXP_SIUL2_PINMUX(0, 0, 101, 0, 67, 2)
#define PTD8_EMIOS_0_CH12_H_O                  NXP_SIUL2_PINMUX(0, 0, 104, 6, 0, 0)
#define PTD8_EMIOS_0_CH12_H_I                  NXP_SIUL2_PINMUX(0, 0, 104, 0, 60, 1)
#define PTD9_EMIOS_0_CH13_H_O                  NXP_SIUL2_PINMUX(0, 0, 105, 6, 0, 0)
#define PTD9_EMIOS_0_CH13_H_I                  NXP_SIUL2_PINMUX(0, 0, 105, 0, 61, 2)
#define PTD10_EMIOS_0_CH16_X_O                 NXP_SIUL2_PINMUX(0, 0, 106, 2, 0, 0)
#define PTD10_EMIOS_0_CH16_X_I                 NXP_SIUL2_PINMUX(0, 0, 106, 0, 64, 3)
#define PTD11_EMIOS_0_CH17_Y_O                 NXP_SIUL2_PINMUX(0, 0, 107, 2, 0, 0)
#define PTD11_EMIOS_0_CH17_Y_I                 NXP_SIUL2_PINMUX(0, 0, 107, 0, 65, 3)
#define PTD12_EMIOS_0_CH18_Y_O                 NXP_SIUL2_PINMUX(0, 0, 108, 2, 0, 0)
#define PTD12_EMIOS_0_CH18_Y_I                 NXP_SIUL2_PINMUX(0, 0, 108, 0, 66, 1)
#define PTD13_EMIOS_0_CH20_Y_O                 NXP_SIUL2_PINMUX(0, 0, 109, 2, 0, 0)
#define PTD13_EMIOS_0_CH20_Y_I                 NXP_SIUL2_PINMUX(0, 0, 109, 0, 68, 1)
#define PTD14_EMIOS_0_CH21_Y_O                 NXP_SIUL2_PINMUX(0, 0, 110, 2, 0, 0)
#define PTD14_EMIOS_0_CH21_Y_I                 NXP_SIUL2_PINMUX(0, 0, 110, 0, 69, 1)
#define PTD15_EMIOS_0_CH0_X_O                  NXP_SIUL2_PINMUX(0, 0, 111, 2, 0, 0)
#define PTD15_EMIOS_0_CH0_X_I                  NXP_SIUL2_PINMUX(0, 0, 111, 0, 48, 2)
#define PTD16_EMIOS_0_CH1_G_O                  NXP_SIUL2_PINMUX(0, 0, 112, 2, 0, 0)
#define PTD16_EMIOS_0_CH1_G_I                  NXP_SIUL2_PINMUX(0, 0, 112, 0, 49, 3)
#define PTD17_EMIOS_0_CH18_Y_O                 NXP_SIUL2_PINMUX(0, 0, 113, 2, 0, 0)
#define PTD17_EMIOS_0_CH18_Y_I                 NXP_SIUL2_PINMUX(0, 0, 113, 0, 66, 3)
#define PTE2_EMIOS_0_CH3_G_O                   NXP_SIUL2_PINMUX(0, 0, 130, 3, 0, 0)
#define PTE2_EMIOS_0_CH3_G_I                   NXP_SIUL2_PINMUX(0, 0, 130, 0, 51, 5)
#define PTE3_EMIOS_0_CH19_Y_O                  NXP_SIUL2_PINMUX(0, 0, 131, 3, 0, 0)
#define PTE3_EMIOS_0_CH19_Y_I                  NXP_SIUL2_PINMUX(0, 0, 131, 0, 67, 4)
#define PTE4_EMIOS_0_CH18_Y_O                  NXP_SIUL2_PINMUX(0, 0, 132, 4, 0, 0)
#define PTE4_EMIOS_0_CH18_Y_I                  NXP_SIUL2_PINMUX(0, 0, 132, 0, 66, 2)
#define PTE5_EMIOS_0_CH19_Y_O                  NXP_SIUL2_PINMUX(0, 0, 133, 4, 0, 0)
#define PTE5_EMIOS_0_CH19_Y_I                  NXP_SIUL2_PINMUX(0, 0, 133, 0, 67, 1)
#define PTE7_EMIOS_0_CH7_G_O                   NXP_SIUL2_PINMUX(0, 0, 135, 2, 0, 0)
#define PTE7_EMIOS_0_CH7_G_I                   NXP_SIUL2_PINMUX(0, 0, 135, 0, 55, 2)
#define PTE8_EMIOS_0_CH6_G_O                   NXP_SIUL2_PINMUX(0, 0, 136, 2, 0, 0)
#define PTE8_EMIOS_0_CH6_G_I                   NXP_SIUL2_PINMUX(0, 0, 136, 0, 54, 1)
#define PTE9_EMIOS_0_CH7_G_O                   NXP_SIUL2_PINMUX(0, 0, 137, 2, 0, 0)
#define PTE9_EMIOS_0_CH7_G_I                   NXP_SIUL2_PINMUX(0, 0, 137, 0, 55, 1)
#define PTE10_EMIOS_0_CH20_Y_O                 NXP_SIUL2_PINMUX(0, 0, 138, 4, 0, 0)
#define PTE10_EMIOS_0_CH20_Y_I                 NXP_SIUL2_PINMUX(0, 0, 138, 0, 68, 2)
#define PTE11_EMIOS_0_CH1_G_O                  NXP_SIUL2_PINMUX(0, 0, 139, 3, 0, 0)
#define PTE11_EMIOS_0_CH21_Y_O                 NXP_SIUL2_PINMUX(0, 0, 139, 4, 0, 0)
#define PTE11_EMIOS_0_CH1_G_I                  NXP_SIUL2_PINMUX(0, 0, 139, 0, 49, 4)
#define PTE11_EMIOS_0_CH21_Y_I                 NXP_SIUL2_PINMUX(0, 0, 139, 0, 69, 2)
#define PTE14_EMIOS_0_CH19_Y_O                 NXP_SIUL2_PINMUX(0, 0, 142, 1, 0, 0)
#define PTE14_EMIOS_0_CH19_Y_I                 NXP_SIUL2_PINMUX(0, 0, 142, 0, 67, 3)
#define PTE15_EMIOS_0_CH22_X_O                 NXP_SIUL2_PINMUX(0, 0, 143, 4, 0, 0)
#define PTE15_EMIOS_0_CH22_X_I                 NXP_SIUL2_PINMUX(0, 0, 143, 0, 70, 1)
#define PTE16_EMIOS_0_CH23_X_O                 NXP_SIUL2_PINMUX(0, 0, 144, 4, 0, 0)
#define PTE16_EMIOS_0_CH23_X_I                 NXP_SIUL2_PINMUX(0, 0, 144, 0, 71, 2)
#define PTE19_EMIOS_0_CH22_X_O                 NXP_SIUL2_PINMUX(0, 0, 147, 2, 0, 0)
#define PTE19_EMIOS_0_CH22_X_I                 NXP_SIUL2_PINMUX(0, 0, 147, 0, 70, 3)

