zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K358_K348_K338_K328_289BGA-pinctrl.h
#define PTE13_FXIO_D5_I                        NXP_SIUL2_PINMUX(0, 0, 141, 0, 157, 5)
#define PTE14_FXIO_D7_O                        NXP_SIUL2_PINMUX(0, 0, 142, 6, 0, 0)
#define PTE14_FXIO_D7_I                        NXP_SIUL2_PINMUX(0, 0, 142, 0, 159, 5)
#define PTE15_FXIO_D2_O                        NXP_SIUL2_PINMUX(0, 0, 143, 6, 0, 0)
#define PTE15_FXIO_D2_I                        NXP_SIUL2_PINMUX(0, 0, 143, 0, 154, 1)
#define PTE16_FXIO_D3_O                        NXP_SIUL2_PINMUX(0, 0, 144, 6, 0, 0)
#define PTE16_FXIO_D3_I                        NXP_SIUL2_PINMUX(0, 0, 144, 0, 155, 2)
#define PTE17_FXIO_D5_O                        NXP_SIUL2_PINMUX(0, 0, 145, 3, 0, 0)
#define PTE17_FXIO_D5_I                        NXP_SIUL2_PINMUX(0, 0, 145, 0, 157, 4)
#define PTE18_FXIO_D4_O                        NXP_SIUL2_PINMUX(0, 0, 146, 3, 0, 0)
#define PTE18_FXIO_D4_I                        NXP_SIUL2_PINMUX(0, 0, 146, 0, 156, 4)
#define PTE24_FXIO_D5_O                        NXP_SIUL2_PINMUX(0, 0, 152, 5, 0, 0)
#define PTE24_FXIO_D11_O                       NXP_SIUL2_PINMUX(0, 0, 152, 7, 0, 0)
#define PTE24_FXIO_D5_I                        NXP_SIUL2_PINMUX(0, 0, 152, 0, 157, 10)
#define PTE24_FXIO_D11_I                       NXP_SIUL2_PINMUX(0, 0, 152, 0, 163, 6)
#define PTF4_FXIO_D0_O                         NXP_SIUL2_PINMUX(0, 0, 164, 4, 0, 0)
#define PTF4_FXIO_D0_I                         NXP_SIUL2_PINMUX(0, 0, 164, 0, 152, 7)
#define PTF7_FXIO_D1_O                         NXP_SIUL2_PINMUX(0, 0, 167, 4, 0, 0)
#define PTF7_FXIO_D1_I                         NXP_SIUL2_PINMUX(0, 0, 167, 0, 153, 8)
#define PTF8_FXIO_D2_O                         NXP_SIUL2_PINMUX(0, 0, 168, 4, 0, 0)
#define PTF8_FXIO_D2_I                         NXP_SIUL2_PINMUX(0, 0, 168, 0, 154, 9)
#define PTF14_FXIO_D3_O                        NXP_SIUL2_PINMUX(0, 0, 174, 5, 0, 0)
#define PTF14_FXIO_D3_I                        NXP_SIUL2_PINMUX(0, 0, 174, 0, 155, 8)
#define PTF20_FXIO_D4_O                        NXP_SIUL2_PINMUX(0, 0, 180, 7, 0, 0)
#define PTF20_FXIO_D4_I                        NXP_SIUL2_PINMUX(0, 0, 180, 0, 156, 8)
#define PTF21_FXIO_D5_O                        NXP_SIUL2_PINMUX(0, 0, 181, 7, 0, 0)
#define PTF21_FXIO_D5_I                        NXP_SIUL2_PINMUX(0, 0, 181, 0, 157, 11)
#define PTF25_FXIO_D6_O                        NXP_SIUL2_PINMUX(0, 0, 185, 7, 0, 0)
#define PTF25_FXIO_D6_I                        NXP_SIUL2_PINMUX(0, 0, 185, 0, 158, 10)
#define PTF28_FXIO_D7_O                        NXP_SIUL2_PINMUX(0, 0, 188, 4, 0, 0)
#define PTF28_FXIO_D7_I                        NXP_SIUL2_PINMUX(0, 0, 188, 0, 159, 8)
#define PTF29_FXIO_D8_O                        NXP_SIUL2_PINMUX(0, 0, 189, 7, 0, 0)
#define PTF29_FXIO_D8_I                        NXP_SIUL2_PINMUX(0, 0, 189, 0, 160, 6)
#define PTF31_FXIO_D9_O                        NXP_SIUL2_PINMUX(0, 0, 191, 6, 0, 0)
#define PTF31_FXIO_D9_I                        NXP_SIUL2_PINMUX(0, 0, 191, 0, 161, 5)
#define PTG6_FXIO_D10_O                        NXP_SIUL2_PINMUX(0, 0, 198, 2, 0, 0)
#define PTG6_FXIO_D10_I                        NXP_SIUL2_PINMUX(0, 0, 198, 0, 162, 5)
#define PTG7_FXIO_D11_O                        NXP_SIUL2_PINMUX(0, 0, 199, 2, 0, 0)
#define PTG7_FXIO_D11_I                        NXP_SIUL2_PINMUX(0, 0, 199, 0, 163, 7)
#define PTG8_FXIO_D12_O                        NXP_SIUL2_PINMUX(0, 0, 200, 2, 0, 0)
#define PTG8_FXIO_D12_I                        NXP_SIUL2_PINMUX(0, 0, 200, 0, 164, 5)
#define PTG13_FXIO_D13_O                       NXP_SIUL2_PINMUX(0, 0, 205, 2, 0, 0)
#define PTG13_FXIO_D13_I                       NXP_SIUL2_PINMUX(0, 0, 205, 0, 165, 5)
#define PTG15_FXIO_D14_O                       NXP_SIUL2_PINMUX(0, 0, 207, 2, 0, 0)
#define PTG15_FXIO_D14_I                       NXP_SIUL2_PINMUX(0, 0, 207, 0, 166, 5)
#define PTG16_FXIO_D15_O                       NXP_SIUL2_PINMUX(0, 0, 208, 3, 0, 0)
#define PTG16_FXIO_D15_I                       NXP_SIUL2_PINMUX(0, 0, 208, 0, 167, 6)
#define PTG17_FXIO_D16_O                       NXP_SIUL2_PINMUX(0, 0, 209, 3, 0, 0)
#define PTG17_FXIO_D16_I                       NXP_SIUL2_PINMUX(0, 0, 209, 0, 168, 4)
#define PTG18_FXIO_D17_O                       NXP_SIUL2_PINMUX(0, 0, 210, 3, 0, 0)
#define PTG18_FXIO_D17_I                       NXP_SIUL2_PINMUX(0, 0, 210, 0, 169, 3)
#define PTG19_FXIO_D18_O                       NXP_SIUL2_PINMUX(0, 0, 211, 3, 0, 0)
#define PTG19_FXIO_D18_I                       NXP_SIUL2_PINMUX(0, 0, 211, 0, 170, 3)
#define PTG20_FXIO_D19_O                       NXP_SIUL2_PINMUX(0, 0, 212, 3, 0, 0)
#define PTG20_FXIO_D19_I                       NXP_SIUL2_PINMUX(0, 0, 212, 0, 171, 6)
#define PTG21_FXIO_D20_O                       NXP_SIUL2_PINMUX(0, 0, 213, 3, 0, 0)
#define PTG21_FXIO_D20_I                       NXP_SIUL2_PINMUX(0, 0, 213, 0, 172, 3)
#define PTG22_FXIO_D21_O                       NXP_SIUL2_PINMUX(0, 0, 214, 3, 0, 0)
#define PTG22_FXIO_D21_I                       NXP_SIUL2_PINMUX(0, 0, 214, 0, 173, 3)
#define PTG23_FXIO_D22_O                       NXP_SIUL2_PINMUX(0, 0, 215, 3, 0, 0)
#define PTG23_FXIO_D22_I                       NXP_SIUL2_PINMUX(0, 0, 215, 0, 174, 3)
#define PTG24_FXIO_D23_O                       NXP_SIUL2_PINMUX(0, 0, 216, 3, 0, 0)
#define PTG24_FXIO_D23_I                       NXP_SIUL2_PINMUX(0, 0, 216, 0, 175, 3)
#define PTG25_FXIO_D24_O                       NXP_SIUL2_PINMUX(0, 0, 217, 3, 0, 0)
#define PTG25_FXIO_D24_I                       NXP_SIUL2_PINMUX(0, 0, 217, 0, 176, 3)
#define PTG26_FXIO_D25_O                       NXP_SIUL2_PINMUX(0, 0, 218, 3, 0, 0)
#define PTG26_FXIO_D25_I                       NXP_SIUL2_PINMUX(0, 0, 218, 0, 177, 3)
#define PTG27_FXIO_D26_O                       NXP_SIUL2_PINMUX(0, 0, 219, 3, 0, 0)
#define PTG27_FXIO_D26_I                       NXP_SIUL2_PINMUX(0, 0, 219, 0, 178, 3)
#define PTG29_FXIO_D29_O                       NXP_SIUL2_PINMUX(0, 0, 221, 3, 0, 0)
#define PTG29_FXIO_D29_I                       NXP_SIUL2_PINMUX(0, 0, 221, 0, 181, 3)
#define PTG30_FXIO_D30_O                       NXP_SIUL2_PINMUX(0, 0, 222, 3, 0, 0)
#define PTG30_FXIO_D30_I                       NXP_SIUL2_PINMUX(0, 0, 222, 0, 182, 3)
#define PTG31_FXIO_D31_O                       NXP_SIUL2_PINMUX(0, 0, 223, 3, 0, 0)
#define PTG31_FXIO_D31_I                       NXP_SIUL2_PINMUX(0, 0, 223, 0, 183, 3)
#define PTH0_FXIO_D16_O                        NXP_SIUL2_PINMUX(0, 0, 224, 3, 0, 0)
#define PTH0_FXIO_D16_I                        NXP_SIUL2_PINMUX(0, 0, 224, 0, 168, 5)
#define PTH1_FXIO_D17_O                        NXP_SIUL2_PINMUX(0, 0, 225, 3, 0, 0)
#define PTH1_FXIO_D17_I                        NXP_SIUL2_PINMUX(0, 0, 225, 0, 169, 4)
#define PTH2_FXIO_D18_O                        NXP_SIUL2_PINMUX(0, 0, 226, 3, 0, 0)
#define PTH2_FXIO_D18_I                        NXP_SIUL2_PINMUX(0, 0, 226, 0, 170, 4)
#define PTH3_FXIO_D19_O                        NXP_SIUL2_PINMUX(0, 0, 227, 3, 0, 0)
#define PTH3_FXIO_D19_I                        NXP_SIUL2_PINMUX(0, 0, 227, 0, 171, 7)
#define PTH4_FXIO_D20_O                        NXP_SIUL2_PINMUX(0, 0, 228, 3, 0, 0)
#define PTH4_FXIO_D20_I                        NXP_SIUL2_PINMUX(0, 0, 228, 0, 172, 4)
#define PTH5_FXIO_D21_O                        NXP_SIUL2_PINMUX(0, 0, 229, 3, 0, 0)
#define PTH5_FXIO_D21_I                        NXP_SIUL2_PINMUX(0, 0, 229, 0, 173, 4)
#define PTH6_FXIO_D22_O                        NXP_SIUL2_PINMUX(0, 0, 230, 3, 0, 0)
#define PTH6_FXIO_D22_I                        NXP_SIUL2_PINMUX(0, 0, 230, 0, 174, 4)
#define PTH7_FXIO_D23_O                        NXP_SIUL2_PINMUX(0, 0, 231, 3, 0, 0)
#define PTH7_FXIO_D23_I                        NXP_SIUL2_PINMUX(0, 0, 231, 0, 175, 4)
#define PTH8_FXIO_D24_O                        NXP_SIUL2_PINMUX(0, 0, 232, 3, 0, 0)
#define PTH8_FXIO_D24_I                        NXP_SIUL2_PINMUX(0, 0, 232, 0, 176, 4)
#define PTH9_FXIO_D25_O                        NXP_SIUL2_PINMUX(0, 0, 233, 3, 0, 0)
#define PTH9_FXIO_D25_I                        NXP_SIUL2_PINMUX(0, 0, 233, 0, 177, 4)
#define PTH10_FXIO_D26_O                       NXP_SIUL2_PINMUX(0, 0, 234, 3, 0, 0)
#define PTH10_FXIO_D26_I                       NXP_SIUL2_PINMUX(0, 0, 234, 0, 178, 4)
#define PTH11_FXIO_D27_O                       NXP_SIUL2_PINMUX(0, 0, 235, 3, 0, 0)
#define PTH11_FXIO_D27_I                       NXP_SIUL2_PINMUX(0, 0, 235, 0, 179, 3)
#define PTH12_FXIO_D28_O                       NXP_SIUL2_PINMUX(0, 0, 236, 3, 0, 0)
#define PTH12_FXIO_D28_I                       NXP_SIUL2_PINMUX(0, 0, 236, 0, 180, 3)

