zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K358_K348_K338_K328_289BGA-pinctrl.h
/* EMIOS_1 */
#define PTA0_EMIOS_1_CH0_X_O                   NXP_SIUL2_PINMUX(0, 0, 0, 5, 0, 0)
#define PTA0_EMIOS_1_CH0_X_I                   NXP_SIUL2_PINMUX(0, 0, 0, 0, 80, 3)
#define PTA2_EMIOS_1_CH19_Y_O                  NXP_SIUL2_PINMUX(0, 0, 2, 2, 0, 0)
#define PTA2_EMIOS_1_CH19_Y_I                  NXP_SIUL2_PINMUX(0, 0, 2, 0, 99, 4)
#define PTA3_EMIOS_1_CH20_Y_O                  NXP_SIUL2_PINMUX(0, 0, 3, 2, 0, 0)
#define PTA3_EMIOS_1_CH20_Y_I                  NXP_SIUL2_PINMUX(0, 0, 3, 0, 100, 4)
#define PTA6_EMIOS_1_CH13_H_O                  NXP_SIUL2_PINMUX(0, 0, 6, 4, 0, 0)
#define PTA6_EMIOS_1_CH13_H_I                  NXP_SIUL2_PINMUX(0, 0, 6, 0, 93, 1)
#define PTA7_EMIOS_1_CH11_H_O                  NXP_SIUL2_PINMUX(0, 0, 7, 3, 0, 0)
#define PTA7_EMIOS_1_CH11_H_I                  NXP_SIUL2_PINMUX(0, 0, 7, 0, 91, 1)
#define PTA8_EMIOS_1_CH12_H_O                  NXP_SIUL2_PINMUX(0, 0, 8, 2, 0, 0)
#define PTA8_EMIOS_1_CH12_H_I                  NXP_SIUL2_PINMUX(0, 0, 8, 0, 92, 2)
#define PTA11_EMIOS_1_CH1_H_O                  NXP_SIUL2_PINMUX(0, 0, 11, 3, 0, 0)
#define PTA11_EMIOS_1_CH1_H_I                  NXP_SIUL2_PINMUX(0, 0, 11, 0, 81, 3)
#define PTA12_EMIOS_1_CH2_H_O                  NXP_SIUL2_PINMUX(0, 0, 12, 6, 0, 0)
#define PTA12_EMIOS_1_CH2_H_I                  NXP_SIUL2_PINMUX(0, 0, 12, 0, 82, 4)
#define PTA13_EMIOS_1_CH3_H_O                  NXP_SIUL2_PINMUX(0, 0, 13, 6, 0, 0)
#define PTA13_EMIOS_1_CH3_H_I                  NXP_SIUL2_PINMUX(0, 0, 13, 0, 83, 4)
#define PTA14_EMIOS_1_CH4_H_O                  NXP_SIUL2_PINMUX(0, 0, 14, 2, 0, 0)
#define PTA14_EMIOS_1_CH4_H_I                  NXP_SIUL2_PINMUX(0, 0, 14, 0, 84, 7)
#define PTA18_EMIOS_1_CH0_X_O                  NXP_SIUL2_PINMUX(0, 0, 18, 2, 0, 0)
#define PTA18_EMIOS_1_CH16_X_O                 NXP_SIUL2_PINMUX(0, 0, 18, 5, 0, 0)
#define PTA18_EMIOS_1_CH0_X_I                  NXP_SIUL2_PINMUX(0, 0, 18, 0, 80, 1)
#define PTA18_EMIOS_1_CH16_X_I                 NXP_SIUL2_PINMUX(0, 0, 18, 0, 96, 1)
#define PTA19_EMIOS_1_CH1_H_O                  NXP_SIUL2_PINMUX(0, 0, 19, 2, 0, 0)
#define PTA19_EMIOS_1_CH1_H_I                  NXP_SIUL2_PINMUX(0, 0, 19, 0, 81, 1)
#define PTA20_EMIOS_1_CH2_H_O                  NXP_SIUL2_PINMUX(0, 0, 20, 2, 0, 0)
#define PTA20_EMIOS_1_CH2_H_I                  NXP_SIUL2_PINMUX(0, 0, 20, 0, 82, 2)
#define PTA21_EMIOS_1_CH3_H_O                  NXP_SIUL2_PINMUX(0, 0, 21, 2, 0, 0)
#define PTA21_EMIOS_1_CH3_H_I                  NXP_SIUL2_PINMUX(0, 0, 21, 0, 83, 1)
#define PTA22_EMIOS_1_CH4_H_O                  NXP_SIUL2_PINMUX(0, 0, 22, 2, 0, 0)
#define PTA22_EMIOS_1_CH4_H_I                  NXP_SIUL2_PINMUX(0, 0, 22, 0, 84, 1)
#define PTA23_EMIOS_1_CH6_H_O                  NXP_SIUL2_PINMUX(0, 0, 23, 2, 0, 0)
#define PTA23_EMIOS_1_CH6_H_I                  NXP_SIUL2_PINMUX(0, 0, 23, 0, 86, 2)
#define PTA24_EMIOS_1_CH7_H                    NXP_SIUL2_PINMUX(0, 0, 23, 0, 87, 2)
#define PTA25_EMIOS_1_CH8_X                    NXP_SIUL2_PINMUX(0, 0, 23, 0, 88, 2)
#define PTA26_EMIOS_1_CH9_H_O                  NXP_SIUL2_PINMUX(0, 0, 26, 2, 0, 0)
#define PTA26_EMIOS_1_CH9_H_I                  NXP_SIUL2_PINMUX(0, 0, 26, 0, 89, 2)
#define PTA27_EMIOS_1_CH10_H_O                 NXP_SIUL2_PINMUX(0, 0, 27, 2, 0, 0)
#define PTA27_EMIOS_1_CH10_H_I                 NXP_SIUL2_PINMUX(0, 0, 27, 0, 90, 3)
#define PTA28_EMIOS_1_CH11_H_O                 NXP_SIUL2_PINMUX(0, 0, 28, 2, 0, 0)
#define PTA28_EMIOS_1_CH11_H_I                 NXP_SIUL2_PINMUX(0, 0, 28, 0, 91, 2)
#define PTA29_EMIOS_1_CH12_H_O                 NXP_SIUL2_PINMUX(0, 0, 29, 2, 0, 0)
#define PTA29_EMIOS_1_CH12_H_I                 NXP_SIUL2_PINMUX(0, 0, 29, 0, 92, 3)
#define PTA30_EMIOS_1_CH13_H_O                 NXP_SIUL2_PINMUX(0, 0, 30, 2, 0, 0)
#define PTA30_EMIOS_1_CH13_H_I                 NXP_SIUL2_PINMUX(0, 0, 30, 0, 93, 2)
#define PTA31_EMIOS_1_CH14_H_O                 NXP_SIUL2_PINMUX(0, 0, 31, 2, 0, 0)
#define PTA31_EMIOS_1_CH14_H_I                 NXP_SIUL2_PINMUX(0, 0, 31, 0, 94, 2)
#define PTB0_EMIOS_1_CH6_H_O                   NXP_SIUL2_PINMUX(0, 0, 32, 6, 0, 0)
#define PTB0_EMIOS_1_CH6_H_I                   NXP_SIUL2_PINMUX(0, 0, 32, 0, 86, 1)
#define PTB1_EMIOS_1_CH5_H_O                   NXP_SIUL2_PINMUX(0, 0, 33, 6, 0, 0)
#define PTB1_EMIOS_1_CH5_H_I                   NXP_SIUL2_PINMUX(0, 0, 33, 0, 85, 1)
#define PTB4_EMIOS_1_CH10_H_O                  NXP_SIUL2_PINMUX(0, 0, 36, 6, 0, 0)
#define PTB4_EMIOS_1_CH10_H_I                  NXP_SIUL2_PINMUX(0, 0, 36, 0, 90, 6)
#define PTB5_EMIOS_1_CH11_H_O                  NXP_SIUL2_PINMUX(0, 0, 37, 6, 0, 0)
#define PTB5_EMIOS_1_CH11_H_I                  NXP_SIUL2_PINMUX(0, 0, 37, 0, 91, 5)
#define PTB8_EMIOS_1_CH15_H_O                  NXP_SIUL2_PINMUX(0, 0, 40, 2, 0, 0)
#define PTB8_EMIOS_1_CH15_H_I                  NXP_SIUL2_PINMUX(0, 0, 40, 0, 95, 6)
#define PTB9_EMIOS_1_CH16_X_O                  NXP_SIUL2_PINMUX(0, 0, 41, 2, 0, 0)
#define PTB9_EMIOS_1_CH16_X_I                  NXP_SIUL2_PINMUX(0, 0, 41, 0, 96, 5)
#define PTB10_EMIOS_1_CH17_Y_O                 NXP_SIUL2_PINMUX(0, 0, 42, 2, 0, 0)
#define PTB10_EMIOS_1_CH17_Y_I                 NXP_SIUL2_PINMUX(0, 0, 42, 0, 97, 4)
#define PTB11_EMIOS_1_CH18_Y_O                 NXP_SIUL2_PINMUX(0, 0, 43, 2, 0, 0)
#define PTB11_EMIOS_1_CH18_Y_I                 NXP_SIUL2_PINMUX(0, 0, 43, 0, 98, 4)
#define PTB17_EMIOS_1_CH7_H_O                  NXP_SIUL2_PINMUX(0, 0, 49, 4, 0, 0)
#define PTB17_EMIOS_1_CH7_H_I                  NXP_SIUL2_PINMUX(0, 0, 49, 0, 87, 7)
#define PTB18_EMIOS_1_CH15_H_O                 NXP_SIUL2_PINMUX(0, 0, 50, 2, 0, 0)
#define PTB18_EMIOS_1_CH15_H_I                 NXP_SIUL2_PINMUX(0, 0, 50, 0, 95, 2)
#define PTB19_EMIOS_1_CH15_H_O                 NXP_SIUL2_PINMUX(0, 0, 51, 2, 0, 0)
#define PTB19_EMIOS_1_CH15_H_I                 NXP_SIUL2_PINMUX(0, 0, 51, 0, 95, 3)
#define PTB20_EMIOS_1_CH16_X_O                 NXP_SIUL2_PINMUX(0, 0, 52, 2, 0, 0)
#define PTB20_EMIOS_1_CH16_X_I                 NXP_SIUL2_PINMUX(0, 0, 52, 0, 96, 3)
#define PTB21_EMIOS_1_CH17_Y_O                 NXP_SIUL2_PINMUX(0, 0, 53, 2, 0, 0)
#define PTB21_EMIOS_1_CH17_Y_I                 NXP_SIUL2_PINMUX(0, 0, 53, 0, 97, 2)
#define PTB22_EMIOS_1_CH18_Y_O                 NXP_SIUL2_PINMUX(0, 0, 54, 2, 0, 0)
#define PTB22_EMIOS_1_CH18_Y_I                 NXP_SIUL2_PINMUX(0, 0, 54, 0, 98, 2)
#define PTB23_EMIOS_1_CH19_Y_O                 NXP_SIUL2_PINMUX(0, 0, 55, 2, 0, 0)
#define PTB23_EMIOS_1_CH19_Y_I                 NXP_SIUL2_PINMUX(0, 0, 55, 0, 99, 2)
#define PTB24_EMIOS_1_CH20_Y_O                 NXP_SIUL2_PINMUX(0, 0, 56, 2, 0, 0)
#define PTB24_EMIOS_1_CH20_Y_I                 NXP_SIUL2_PINMUX(0, 0, 56, 0, 100, 2)
#define PTB25_EMIOS_1_CH21_Y_O                 NXP_SIUL2_PINMUX(0, 0, 57, 2, 0, 0)
#define PTB25_EMIOS_1_CH21_Y_I                 NXP_SIUL2_PINMUX(0, 0, 57, 0, 101, 2)
#define PTB26_EMIOS_1_CH22_X_O                 NXP_SIUL2_PINMUX(0, 0, 58, 2, 0, 0)
#define PTB26_EMIOS_1_CH22_X_I                 NXP_SIUL2_PINMUX(0, 0, 58, 0, 102, 2)
#define PTB27_EMIOS_1_CH23_X_O                 NXP_SIUL2_PINMUX(0, 0, 59, 2, 0, 0)
#define PTB27_EMIOS_1_CH23_X_I                 NXP_SIUL2_PINMUX(0, 0, 59, 0, 103, 2)
#define PTC6_EMIOS_1_CH6_H_O                   NXP_SIUL2_PINMUX(0, 0, 70, 5, 0, 0)
#define PTC6_EMIOS_1_CH6_H_I                   NXP_SIUL2_PINMUX(0, 0, 70, 0, 86, 4)
#define PTC7_EMIOS_1_CH7_H_O                   NXP_SIUL2_PINMUX(0, 0, 71, 5, 0, 0)
#define PTC7_EMIOS_1_CH7_H_I                   NXP_SIUL2_PINMUX(0, 0, 71, 0, 87, 4)
#define PTC8_EMIOS_1_CH9_H_O                   NXP_SIUL2_PINMUX(0, 0, 72, 4, 0, 0)
#define PTC8_EMIOS_1_CH9_H_I                   NXP_SIUL2_PINMUX(0, 0, 72, 0, 89, 1)
#define PTC9_EMIOS_1_CH8_X_O                   NXP_SIUL2_PINMUX(0, 0, 73, 4, 0, 0)
#define PTC9_EMIOS_1_CH8_X_I                   NXP_SIUL2_PINMUX(0, 0, 73, 0, 88, 1)
#define PTC10_EMIOS_1_CH0_X_O                  NXP_SIUL2_PINMUX(0, 0, 74, 7, 0, 0)
#define PTC10_EMIOS_1_CH0_X_I                  NXP_SIUL2_PINMUX(0, 0, 74, 0, 80, 6)
#define PTC11_EMIOS_1_CH1_H_O                  NXP_SIUL2_PINMUX(0, 0, 75, 3, 0, 0)
#define PTC11_EMIOS_1_CH1_H_I                  NXP_SIUL2_PINMUX(0, 0, 75, 0, 81, 7)
#define PTC12_EMIOS_1_CH2_H_O                  NXP_SIUL2_PINMUX(0, 0, 76, 2, 0, 0)
#define PTC12_EMIOS_1_CH2_H_I                  NXP_SIUL2_PINMUX(0, 0, 76, 0, 82, 1)
#define PTC13_EMIOS_1_CH3_H_O                  NXP_SIUL2_PINMUX(0, 0, 77, 2, 0, 0)
#define PTC13_EMIOS_1_CH3_H_I                  NXP_SIUL2_PINMUX(0, 0, 77, 0, 83, 7)
#define PTC14_EMIOS_1_CH4_H_O                  NXP_SIUL2_PINMUX(0, 0, 78, 5, 0, 0)
#define PTC14_EMIOS_1_CH4_H_I                  NXP_SIUL2_PINMUX(0, 0, 78, 0, 84, 8)
#define PTC16_EMIOS_1_CH9_H_O                  NXP_SIUL2_PINMUX(0, 0, 80, 2, 0, 0)
#define PTC16_EMIOS_1_CH9_H_I                  NXP_SIUL2_PINMUX(0, 0, 80, 0, 89, 5)
#define PTC24_EMIOS_1_CH0_X_O                  NXP_SIUL2_PINMUX(0, 0, 88, 2, 0, 0)
#define PTC24_EMIOS_1_CH0_X_I                  NXP_SIUL2_PINMUX(0, 0, 88, 0, 80, 4)
#define PTC25_EMIOS_1_CH1_H_O                  NXP_SIUL2_PINMUX(0, 0, 89, 2, 0, 0)
#define PTC25_EMIOS_1_CH1_H_I                  NXP_SIUL2_PINMUX(0, 0, 89, 0, 81, 4)
#define PTC26_EMIOS_1_CH3_H_O                  NXP_SIUL2_PINMUX(0, 0, 90, 2, 0, 0)
#define PTC26_EMIOS_1_CH3_H_I                  NXP_SIUL2_PINMUX(0, 0, 90, 0, 83, 3)
#define PTC27_EMIOS_1_CH4_H_O                  NXP_SIUL2_PINMUX(0, 0, 91, 2, 0, 0)
#define PTC27_EMIOS_1_CH4_H_I                  NXP_SIUL2_PINMUX(0, 0, 91, 0, 84, 2)
#define PTC28_EMIOS_1_CH7_H_O                  NXP_SIUL2_PINMUX(0, 0, 92, 2, 0, 0)
#define PTC28_EMIOS_1_CH7_H_I                  NXP_SIUL2_PINMUX(0, 0, 92, 0, 87, 3)
#define PTC29_EMIOS_1_CH10_H_O                 NXP_SIUL2_PINMUX(0, 0, 93, 2, 0, 0)
#define PTC29_EMIOS_1_CH10_H_I                 NXP_SIUL2_PINMUX(0, 0, 93, 0, 90, 1)
#define PTC30_EMIOS_1_CH12_H_O                 NXP_SIUL2_PINMUX(0, 0, 94, 2, 0, 0)
#define PTC30_EMIOS_1_CH12_H_I                 NXP_SIUL2_PINMUX(0, 0, 94, 0, 92, 1)
#define PTC31_EMIOS_1_CH14_H_O                 NXP_SIUL2_PINMUX(0, 0, 95, 2, 0, 0)
#define PTC31_EMIOS_1_CH14_H_I                 NXP_SIUL2_PINMUX(0, 0, 95, 0, 94, 1)
#define PTD2_EMIOS_1_CH21_Y_O                  NXP_SIUL2_PINMUX(0, 0, 98, 2, 0, 0)
#define PTD2_EMIOS_1_CH21_Y_I                  NXP_SIUL2_PINMUX(0, 0, 98, 0, 101, 4)
#define PTD3_EMIOS_1_CH22_X_O                  NXP_SIUL2_PINMUX(0, 0, 99, 2, 0, 0)
#define PTD3_EMIOS_1_CH22_X_I                  NXP_SIUL2_PINMUX(0, 0, 99, 0, 102, 4)
#define PTD4_EMIOS_1_CH23_X_O                  NXP_SIUL2_PINMUX(0, 0, 100, 2, 0, 0)
#define PTD4_EMIOS_1_CH23_X_I                  NXP_SIUL2_PINMUX(0, 0, 100, 0, 103, 4)
#define PTD6_EMIOS_1_CH12_H_O                  NXP_SIUL2_PINMUX(0, 0, 102, 3, 0, 0)
#define PTD6_EMIOS_1_CH12_H_I                  NXP_SIUL2_PINMUX(0, 0, 102, 0, 92, 5)
#define PTD10_EMIOS_1_CH10_H_O                 NXP_SIUL2_PINMUX(0, 0, 106, 3, 0, 0)
#define PTD10_EMIOS_1_CH10_H_I                 NXP_SIUL2_PINMUX(0, 0, 106, 0, 90, 2)
#define PTD15_EMIOS_1_CH14_H_O                 NXP_SIUL2_PINMUX(0, 0, 111, 3, 0, 0)
#define PTD15_EMIOS_1_CH14_H_I                 NXP_SIUL2_PINMUX(0, 0, 111, 0, 94, 6)
#define PTD16_EMIOS_1_CH15_H_O                 NXP_SIUL2_PINMUX(0, 0, 112, 5, 0, 0)
#define PTD16_EMIOS_1_CH15_H_I                 NXP_SIUL2_PINMUX(0, 0, 112, 0, 95, 7)
#define PTD18_EMIOS_1_CH15_H_O                 NXP_SIUL2_PINMUX(0, 0, 114, 2, 0, 0)
#define PTD18_EMIOS_1_CH15_H_I                 NXP_SIUL2_PINMUX(0, 0, 114, 0, 95, 1)
#define PTD19_EMIOS_1_CH16_X_O                 NXP_SIUL2_PINMUX(0, 0, 115, 2, 0, 0)
#define PTD19_EMIOS_1_CH16_X_I                 NXP_SIUL2_PINMUX(0, 0, 115, 0, 96, 2)
#define PTD20_EMIOS_1_CH17_Y_O                 NXP_SIUL2_PINMUX(0, 0, 116, 2, 0, 0)
#define PTD20_EMIOS_1_CH17_Y_I                 NXP_SIUL2_PINMUX(0, 0, 116, 0, 97, 1)
#define PTD21_EMIOS_1_CH18_Y_O                 NXP_SIUL2_PINMUX(0, 0, 117, 2, 0, 0)
#define PTD21_EMIOS_1_CH18_Y_I                 NXP_SIUL2_PINMUX(0, 0, 117, 0, 98, 1)
#define PTD22_EMIOS_1_CH19_Y_O                 NXP_SIUL2_PINMUX(0, 0, 118, 2, 0, 0)
#define PTD22_EMIOS_1_CH19_Y_I                 NXP_SIUL2_PINMUX(0, 0, 118, 0, 99, 1)
#define PTD23_EMIOS_1_CH20_Y_O                 NXP_SIUL2_PINMUX(0, 0, 119, 2, 0, 0)
#define PTD23_EMIOS_1_CH20_Y_I                 NXP_SIUL2_PINMUX(0, 0, 119, 0, 100, 1)
#define PTD24_EMIOS_1_CH21_Y_O                 NXP_SIUL2_PINMUX(0, 0, 120, 2, 0, 0)
#define PTD24_EMIOS_1_CH21_Y_I                 NXP_SIUL2_PINMUX(0, 0, 120, 0, 101, 1)
#define PTD25_EMIOS_1_CH22_X_O                 NXP_SIUL2_PINMUX(0, 0, 121, 2, 0, 0)
#define PTD25_EMIOS_1_CH22_X_I                 NXP_SIUL2_PINMUX(0, 0, 121, 0, 102, 1)
#define PTD26_EMIOS_1_CH23_X_O                 NXP_SIUL2_PINMUX(0, 0, 122, 2, 0, 0)
#define PTD26_EMIOS_1_CH23_X_I                 NXP_SIUL2_PINMUX(0, 0, 122, 0, 103, 1)
#define PTE2_EMIOS_1_CH8_X_O                   NXP_SIUL2_PINMUX(0, 0, 130, 4, 0, 0)
#define PTE2_EMIOS_1_CH8_X_I                   NXP_SIUL2_PINMUX(0, 0, 130, 0, 88, 4)
#define PTE4_EMIOS_1_CH4_H_O                   NXP_SIUL2_PINMUX(0, 0, 132, 3, 0, 0)
#define PTE4_EMIOS_1_CH4_H_I                   NXP_SIUL2_PINMUX(0, 0, 132, 0, 84, 4)
#define PTE5_EMIOS_1_CH5_H_O                   NXP_SIUL2_PINMUX(0, 0, 133, 3, 0, 0)
#define PTE5_EMIOS_1_CH5_H_I                   NXP_SIUL2_PINMUX(0, 0, 133, 0, 85, 4)
#define PTE6_EMIOS_1_CH14_H_O                  NXP_SIUL2_PINMUX(0, 0, 134, 4, 0, 0)
#define PTE6_EMIOS_1_CH14_H_I                  NXP_SIUL2_PINMUX(0, 0, 134, 0, 94, 5)
#define PTE9_EMIOS_1_CH13_H_O                  NXP_SIUL2_PINMUX(0, 0, 137, 3, 0, 0)
#define PTE9_EMIOS_1_CH13_H_I                  NXP_SIUL2_PINMUX(0, 0, 137, 0, 93, 5)
#define PTE12_EMIOS_1_CH5_H_O                  NXP_SIUL2_PINMUX(0, 0, 140, 4, 0, 0)
#define PTE12_EMIOS_1_CH5_H_I                  NXP_SIUL2_PINMUX(0, 0, 140, 0, 85, 5)
#define PTE13_EMIOS_1_CH5_H_O                  NXP_SIUL2_PINMUX(0, 0, 141, 2, 0, 0)
#define PTE13_EMIOS_1_CH5_H_I                  NXP_SIUL2_PINMUX(0, 0, 141, 0, 85, 3)
#define PTE20_EMIOS_1_CH0_X_O                  NXP_SIUL2_PINMUX(0, 0, 148, 2, 0, 0)
#define PTE20_EMIOS_1_CH0_X_I                  NXP_SIUL2_PINMUX(0, 0, 148, 0, 80, 2)
#define PTE21_EMIOS_1_CH1_H_O                  NXP_SIUL2_PINMUX(0, 0, 149, 2, 0, 0)
#define PTE21_EMIOS_1_CH1_H_I                  NXP_SIUL2_PINMUX(0, 0, 149, 0, 81, 2)
#define PTE22_EMIOS_1_CH2_H_O                  NXP_SIUL2_PINMUX(0, 0, 150, 2, 0, 0)
#define PTE22_EMIOS_1_CH2_H_I                  NXP_SIUL2_PINMUX(0, 0, 150, 0, 82, 3)
#define PTE23_EMIOS_1_CH3_H_O                  NXP_SIUL2_PINMUX(0, 0, 151, 2, 0, 0)
#define PTE23_EMIOS_1_CH3_H_I                  NXP_SIUL2_PINMUX(0, 0, 151, 0, 83, 2)
#define PTE24_EMIOS_1_CH4_H_O                  NXP_SIUL2_PINMUX(0, 0, 152, 2, 0, 0)
#define PTE24_EMIOS_1_CH4_H_I                  NXP_SIUL2_PINMUX(0, 0, 152, 0, 84, 3)
#define PTE25_EMIOS_1_CH5_H_O                  NXP_SIUL2_PINMUX(0, 0, 153, 2, 0, 0)
#define PTE25_EMIOS_1_CH5_H_I                  NXP_SIUL2_PINMUX(0, 0, 153, 0, 85, 2)
#define PTE26_EMIOS_1_CH6_H_O                  NXP_SIUL2_PINMUX(0, 0, 154, 2, 0, 0)
#define PTE26_EMIOS_1_CH6_H_I                  NXP_SIUL2_PINMUX(0, 0, 154, 0, 86, 3)
#define PTE27_EMIOS_1_CH7_H_O                  NXP_SIUL2_PINMUX(0, 0, 155, 2, 0, 0)
#define PTE27_EMIOS_1_CH7_H_I                  NXP_SIUL2_PINMUX(0, 0, 155, 0, 87, 1)
#define PTF16_EMIOS_1_CH0_X_O                  NXP_SIUL2_PINMUX(0, 0, 176, 3, 0, 0)
#define PTF16_EMIOS_1_CH0_X_I                  NXP_SIUL2_PINMUX(0, 0, 176, 0, 80, 5)
#define PTF17_EMIOS_1_CH1_H_O                  NXP_SIUL2_PINMUX(0, 0, 177, 3, 0, 0)
#define PTF17_EMIOS_1_CH1_H_I                  NXP_SIUL2_PINMUX(0, 0, 177, 0, 81, 5)
#define PTF18_EMIOS_1_CH2_H_O                  NXP_SIUL2_PINMUX(0, 0, 178, 3, 0, 0)
#define PTF18_EMIOS_1_CH2_H_I                  NXP_SIUL2_PINMUX(0, 0, 178, 0, 82, 5)
#define PTF19_EMIOS_1_CH3_H_O                  NXP_SIUL2_PINMUX(0, 0, 179, 3, 0, 0)
#define PTF19_EMIOS_1_CH3_H_I                  NXP_SIUL2_PINMUX(0, 0, 179, 0, 83, 5)
#define PTF20_EMIOS_1_CH4_H_O                  NXP_SIUL2_PINMUX(0, 0, 180, 3, 0, 0)
#define PTF20_EMIOS_1_CH4_H_I                  NXP_SIUL2_PINMUX(0, 0, 180, 0, 84, 5)
#define PTF21_EMIOS_1_CH5_H_O                  NXP_SIUL2_PINMUX(0, 0, 181, 3, 0, 0)
#define PTF21_EMIOS_1_CH5_H_I                  NXP_SIUL2_PINMUX(0, 0, 181, 0, 85, 6)
#define PTF22_EMIOS_1_CH6_H_O                  NXP_SIUL2_PINMUX(0, 0, 182, 3, 0, 0)
#define PTF22_EMIOS_1_CH6_H_I                  NXP_SIUL2_PINMUX(0, 0, 182, 0, 86, 5)
#define PTF23_EMIOS_1_CH7_H_O                  NXP_SIUL2_PINMUX(0, 0, 183, 3, 0, 0)
#define PTF23_EMIOS_1_CH7_H_I                  NXP_SIUL2_PINMUX(0, 0, 183, 0, 87, 5)
#define PTF24_EMIOS_1_CH8_X_O                  NXP_SIUL2_PINMUX(0, 0, 184, 3, 0, 0)
#define PTF24_EMIOS_1_CH8_X_I                  NXP_SIUL2_PINMUX(0, 0, 184, 0, 88, 3)
#define PTF25_EMIOS_1_CH9_H_O                  NXP_SIUL2_PINMUX(0, 0, 185, 3, 0, 0)
#define PTF25_EMIOS_1_CH9_H_I                  NXP_SIUL2_PINMUX(0, 0, 185, 0, 89, 3)
#define PTF26_EMIOS_1_CH10_H_O                 NXP_SIUL2_PINMUX(0, 0, 186, 3, 0, 0)
#define PTF26_EMIOS_1_CH10_H_I                 NXP_SIUL2_PINMUX(0, 0, 186, 0, 90, 4)
#define PTF27_EMIOS_1_CH11_H_O                 NXP_SIUL2_PINMUX(0, 0, 187, 3, 0, 0)
#define PTF27_EMIOS_1_CH11_H_I                 NXP_SIUL2_PINMUX(0, 0, 187, 0, 91, 3)
#define PTF28_EMIOS_1_CH12_H_O                 NXP_SIUL2_PINMUX(0, 0, 188, 3, 0, 0)
#define PTF28_EMIOS_1_CH12_H_I                 NXP_SIUL2_PINMUX(0, 0, 188, 0, 92, 4)
#define PTF29_EMIOS_1_CH13_H_O                 NXP_SIUL2_PINMUX(0, 0, 189, 3, 0, 0)
#define PTF29_EMIOS_1_CH13_H_I                 NXP_SIUL2_PINMUX(0, 0, 189, 0, 93, 3)
#define PTF30_EMIOS_1_CH14_H_O                 NXP_SIUL2_PINMUX(0, 0, 190, 3, 0, 0)
#define PTF30_EMIOS_1_CH14_H_I                 NXP_SIUL2_PINMUX(0, 0, 190, 0, 94, 3)
#define PTF31_EMIOS_1_CH15_H_O                 NXP_SIUL2_PINMUX(0, 0, 191, 3, 0, 0)
#define PTF31_EMIOS_1_CH15_H_I                 NXP_SIUL2_PINMUX(0, 0, 191, 0, 95, 4)
#define PTG0_EMIOS_1_CH16_X_O                  NXP_SIUL2_PINMUX(0, 0, 192, 3, 0, 0)
#define PTG0_EMIOS_1_CH16_X_I                  NXP_SIUL2_PINMUX(0, 0, 192, 0, 96, 4)
#define PTG1_EMIOS_1_CH17_Y_O                  NXP_SIUL2_PINMUX(0, 0, 193, 3, 0, 0)
#define PTG1_EMIOS_1_CH17_Y_I                  NXP_SIUL2_PINMUX(0, 0, 193, 0, 97, 3)
#define PTG2_EMIOS_1_CH18_Y_O                  NXP_SIUL2_PINMUX(0, 0, 194, 3, 0, 0)
#define PTG2_EMIOS_1_CH18_Y_I                  NXP_SIUL2_PINMUX(0, 0, 194, 0, 98, 3)
#define PTG3_EMIOS_1_CH19_Y_O                  NXP_SIUL2_PINMUX(0, 0, 195, 3, 0, 0)
#define PTG3_EMIOS_1_CH19_Y_I                  NXP_SIUL2_PINMUX(0, 0, 195, 0, 99, 3)
#define PTG4_EMIOS_1_CH20_Y_O                  NXP_SIUL2_PINMUX(0, 0, 196, 3, 0, 0)
#define PTG4_EMIOS_1_CH20_Y_I                  NXP_SIUL2_PINMUX(0, 0, 196, 0, 100, 3)
#define PTG5_EMIOS_1_CH21_Y_O                  NXP_SIUL2_PINMUX(0, 0, 197, 3, 0, 0)
#define PTG5_EMIOS_1_CH21_Y_I                  NXP_SIUL2_PINMUX(0, 0, 197, 0, 101, 3)
#define PTG6_EMIOS_1_CH22_X_O                  NXP_SIUL2_PINMUX(0, 0, 198, 3, 0, 0)
#define PTG6_EMIOS_1_CH22_X_I                  NXP_SIUL2_PINMUX(0, 0, 198, 0, 102, 3)
#define PTG7_EMIOS_1_CH23_X_O                  NXP_SIUL2_PINMUX(0, 0, 199, 3, 0, 0)
#define PTG7_EMIOS_1_CH23_X_I                  NXP_SIUL2_PINMUX(0, 0, 199, 0, 103, 3)

