zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K358_K348_K338_K328_289BGA-pinctrl.h
/* LPUART0 */
#define PTA0_LPUART0_CTS                       NXP_SIUL2_PINMUX(0, 0, 0, 0, 360, 1)
#define PTA1_LPUART0_RTS                       NXP_SIUL2_PINMUX(0, 0, 1, 3, 0, 0)
#define PTA2_LPUART0_RX                        NXP_SIUL2_PINMUX(0, 0, 2, 0, 187, 1)
#define PTA3_LPUART0_TX_O                      NXP_SIUL2_PINMUX(0, 0, 3, 6, 0, 0)
#define PTA3_LPUART0_TX_I                      NXP_SIUL2_PINMUX(0, 0, 3, 0, 363, 1)
#define PTA6_LPUART0_RIN_B                     NXP_SIUL2_PINMUX(0, 0, 6, 0, 375, 1)
#define PTA7_LPUART0_DCD_B                     NXP_SIUL2_PINMUX(0, 0, 7, 0, 374, 1)
#define PTA27_LPUART0_TX_O                     NXP_SIUL2_PINMUX(0, 0, 27, 4, 0, 0)
#define PTA27_LPUART0_TX_I                     NXP_SIUL2_PINMUX(0, 0, 27, 0, 363, 4)
#define PTA28_LPUART0_RX                       NXP_SIUL2_PINMUX(0, 0, 28, 0, 187, 4)
#define PTB0_LPUART0_RX                        NXP_SIUL2_PINMUX(0, 0, 32, 0, 187, 2)
#define PTB1_LPUART0_TX_O                      NXP_SIUL2_PINMUX(0, 0, 33, 2, 0, 0)
#define PTB1_LPUART0_TX_I                      NXP_SIUL2_PINMUX(0, 0, 33, 0, 363, 2)
#define PTB10_LPUART0_DTR_B                    NXP_SIUL2_PINMUX(0, 0, 42, 3, 0, 0)
#define PTB11_LPUART0_DSR_B                    NXP_SIUL2_PINMUX(0, 0, 43, 0, 373, 2)
#define PTB12_LPUART0_DCD_B                    NXP_SIUL2_PINMUX(0, 0, 44, 0, 374, 2)
#define PTB13_LPUART0_RIN_B                    NXP_SIUL2_PINMUX(0, 0, 45, 0, 375, 2)
#define PTC2_LPUART0_RX                        NXP_SIUL2_PINMUX(0, 0, 66, 0, 187, 3)
#define PTC3_LPUART0_TX_O                      NXP_SIUL2_PINMUX(0, 0, 67, 4, 0, 0)
#define PTC3_LPUART0_TX_I                      NXP_SIUL2_PINMUX(0, 0, 67, 0, 363, 3)
#define PTC8_LPUART0_CTS                       NXP_SIUL2_PINMUX(0, 0, 72, 0, 360, 2)
#define PTC9_LPUART0_RTS                       NXP_SIUL2_PINMUX(0, 0, 73, 3, 0, 0)
#define PTC10_LPUART0_DSR_B                    NXP_SIUL2_PINMUX(0, 0, 74, 0, 373, 1)
#define PTC11_LPUART0_DTR_B                    NXP_SIUL2_PINMUX(0, 0, 75, 2, 0, 0)
#define PTH0_LPUART0_TX_O                      NXP_SIUL2_PINMUX(0, 0, 224, 2, 0, 0)
#define PTH0_LPUART0_TX_I                      NXP_SIUL2_PINMUX(0, 0, 224, 0, 363, 5)
#define PTH1_LPUART0_RX                        NXP_SIUL2_PINMUX(0, 0, 225, 0, 187, 5)

/* FCCU */
#define PTA2_FCCU_ERR0                         NXP_SIUL2_PINMUX(0, 0, 2, 1, 0, 0)
#define PTA2_FCCU_ERR_IN0                      NXP_SIUL2_PINMUX(0, 0, 2, 0, 148, 1)
#define PTA3_FCCU_ERR1                         NXP_SIUL2_PINMUX(0, 0, 3, 1, 0, 0)
#define PTA3_FCCU_ERR_IN1                      NXP_SIUL2_PINMUX(0, 0, 3, 0, 149, 1)
#define PTE15_FCCU_ERR0                        NXP_SIUL2_PINMUX(0, 0, 143, 1, 0, 0)
#define PTE15_FCCU_ERR_IN0                     NXP_SIUL2_PINMUX(0, 0, 143, 0, 148, 2)
#define PTE16_FCCU_ERR1                        NXP_SIUL2_PINMUX(0, 0, 144, 1, 0, 0)
#define PTE16_FCCU_ERR_IN1                     NXP_SIUL2_PINMUX(0, 0, 144, 0, 149, 2)
#define PTF14_FCCU_ERR0                        NXP_SIUL2_PINMUX(0, 0, 174, 4, 0, 0)
#define PTF14_FCCU_ERR_IN0                     NXP_SIUL2_PINMUX(0, 0, 174, 0, 148, 3)
#define PTF15_FCCU_ERR1                        NXP_SIUL2_PINMUX(0, 0, 175, 5, 0, 0)
#define PTF15_FCCU_ERR_IN1                     NXP_SIUL2_PINMUX(0, 0, 175, 0, 149, 3)

/* LPSPI5 */
#define PTA2_LPSPI5_SIN_O                      NXP_SIUL2_PINMUX(0, 0, 2, 7, 0, 0)
#define PTA2_LPSPI5_SIN_I                      NXP_SIUL2_PINMUX(0, 0, 2, 0, 267, 2)
#define PTA3_LPSPI5_SCK_O                      NXP_SIUL2_PINMUX(0, 0, 3, 7, 0, 0)
#define PTA3_LPSPI5_SCK_I                      NXP_SIUL2_PINMUX(0, 0, 3, 0, 266, 2)
#define PTA14_LPSPI5_PCS1_O                    NXP_SIUL2_PINMUX(0, 0, 14, 7, 0, 0)
#define PTA14_LPSPI5_PCS1_I                    NXP_SIUL2_PINMUX(0, 0, 14, 0, 263, 2)
#define PTA15_LPSPI5_PCS0_O                    NXP_SIUL2_PINMUX(0, 0, 15, 6, 0, 0)
#define PTA15_LPSPI5_PCS0_I                    NXP_SIUL2_PINMUX(0, 0, 15, 0, 262, 3)
#define PTD2_LPSPI5_SOUT_O                     NXP_SIUL2_PINMUX(0, 0, 98, 7, 0, 0)
#define PTD2_LPSPI5_SOUT_I                     NXP_SIUL2_PINMUX(0, 0, 98, 0, 268, 2)
#define PTD4_LPSPI5_PCS0_O                     NXP_SIUL2_PINMUX(0, 0, 100, 7, 0, 0)
#define PTD4_LPSPI5_PCS0_I                     NXP_SIUL2_PINMUX(0, 0, 100, 0, 262, 2)
#define PTD13_LPSPI5_SIN_O                     NXP_SIUL2_PINMUX(0, 0, 109, 1, 0, 0)
#define PTD13_LPSPI5_SIN_I                     NXP_SIUL2_PINMUX(0, 0, 109, 0, 267, 1)
#define PTD14_LPSPI5_SCK_O                     NXP_SIUL2_PINMUX(0, 0, 110, 1, 0, 0)
#define PTD14_LPSPI5_SCK_I                     NXP_SIUL2_PINMUX(0, 0, 110, 0, 266, 1)
#define PTD17_LPSPI5_PCS0_O                    NXP_SIUL2_PINMUX(0, 0, 113, 1, 0, 0)
#define PTD17_LPSPI5_PCS0_I                    NXP_SIUL2_PINMUX(0, 0, 113, 0, 262, 1)
#define PTD26_LPSPI5_SCK_O                     NXP_SIUL2_PINMUX(0, 0, 122, 6, 0, 0)
#define PTD26_LPSPI5_SCK_I                     NXP_SIUL2_PINMUX(0, 0, 122, 0, 266, 3)
#define PTD27_LPSPI5_SOUT_O                    NXP_SIUL2_PINMUX(0, 0, 123, 6, 0, 0)
#define PTD27_LPSPI5_SOUT_I                    NXP_SIUL2_PINMUX(0, 0, 123, 0, 268, 3)
#define PTD28_LPSPI5_SIN_O                     NXP_SIUL2_PINMUX(0, 0, 124, 6, 0, 0)
#define PTD28_LPSPI5_SIN_I                     NXP_SIUL2_PINMUX(0, 0, 124, 0, 267, 3)
#define PTD29_LPSPI5_PCS2_O                    NXP_SIUL2_PINMUX(0, 0, 125, 6, 0, 0)
#define PTD29_LPSPI5_PCS2_I                    NXP_SIUL2_PINMUX(0, 0, 125, 0, 264, 1)
#define PTD30_LPSPI5_PCS3_O                    NXP_SIUL2_PINMUX(0, 0, 126, 6, 0, 0)
#define PTD30_LPSPI5_PCS3_I                    NXP_SIUL2_PINMUX(0, 0, 126, 0, 265, 1)
#define PTE8_LPSPI5_PCS1_O                     NXP_SIUL2_PINMUX(0, 0, 136, 3, 0, 0)
#define PTE8_LPSPI5_PCS1_I                     NXP_SIUL2_PINMUX(0, 0, 136, 0, 263, 1)
#define PTE9_LPSPI5_SOUT_O                     NXP_SIUL2_PINMUX(0, 0, 137, 1, 0, 0)
#define PTE9_LPSPI5_SOUT_I                     NXP_SIUL2_PINMUX(0, 0, 137, 0, 268, 1)
#define PTG28_LPSPI5_PCS0_O                    NXP_SIUL2_PINMUX(0, 0, 220, 1, 0, 0)
#define PTG28_LPSPI5_PCS0_I                    NXP_SIUL2_PINMUX(0, 0, 220, 0, 262, 4)
#define PTG29_LPSPI5_SIN_O                     NXP_SIUL2_PINMUX(0, 0, 221, 1, 0, 0)
#define PTG29_LPSPI5_SIN_I                     NXP_SIUL2_PINMUX(0, 0, 221, 0, 267, 4)
#define PTG30_LPSPI5_SOUT_O                    NXP_SIUL2_PINMUX(0, 0, 222, 1, 0, 0)
#define PTG30_LPSPI5_SOUT_I                    NXP_SIUL2_PINMUX(0, 0, 222, 0, 268, 4)
#define PTG31_LPSPI5_SCK_O                     NXP_SIUL2_PINMUX(0, 0, 223, 1, 0, 0)
#define PTG31_LPSPI5_SCK_I                     NXP_SIUL2_PINMUX(0, 0, 223, 0, 266, 4)

