zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K358_K348_K338_K328_289BGA-pinctrl.h
/* CAN1 */
#define PTA11_CAN1_TX                          NXP_SIUL2_PINMUX(0, 0, 11, 1, 0, 0)
#define PTA12_CAN1_RX                          NXP_SIUL2_PINMUX(0, 0, 12, 0, 1, 2)
#define PTA22_CAN1_RX                          NXP_SIUL2_PINMUX(0, 0, 22, 0, 1, 3)
#define PTA23_CAN1_TX                          NXP_SIUL2_PINMUX(0, 0, 23, 1, 0, 0)
#define PTB22_CAN1_TX                          NXP_SIUL2_PINMUX(0, 0, 54, 1, 0, 0)
#define PTB23_CAN1_RX                          NXP_SIUL2_PINMUX(0, 0, 55, 0, 1, 4)
#define PTC8_CAN1_TX                           NXP_SIUL2_PINMUX(0, 0, 72, 3, 0, 0)
#define PTC9_CAN1_RX                           NXP_SIUL2_PINMUX(0, 0, 73, 0, 1, 1)
#define PTF14_CAN1_TX                          NXP_SIUL2_PINMUX(0, 0, 174, 1, 0, 0)
#define PTF15_CAN1_RX                          NXP_SIUL2_PINMUX(0, 0, 175, 0, 1, 5)

/* CMP1 */
#define PTA12_CMP1_OUT                         NXP_SIUL2_PINMUX(0, 0, 12, 7, 0, 0)
#define PTE15_CMP1_RR_ACTIVE                   NXP_SIUL2_PINMUX(0, 0, 143, 5, 0, 0)
#define PTE30_CMP1_OUT                         NXP_SIUL2_PINMUX(0, 0, 158, 2, 0, 0)
#define PTE31_CMP1_RR_ACTIVE                   NXP_SIUL2_PINMUX(0, 0, 159, 2, 0, 0)

/* LPUART11 */
#define PTA12_LPUART11_RX                      NXP_SIUL2_PINMUX(0, 0, 12, 0, 198, 2)
#define PTA13_LPUART11_TX_O                    NXP_SIUL2_PINMUX(0, 0, 13, 7, 0, 0)
#define PTA13_LPUART11_TX_I                    NXP_SIUL2_PINMUX(0, 0, 13, 0, 412, 1)
#define PTC10_LPUART11_TX_O                    NXP_SIUL2_PINMUX(0, 0, 74, 2, 0, 0)
#define PTC10_LPUART11_TX_I                    NXP_SIUL2_PINMUX(0, 0, 74, 0, 412, 2)
#define PTC11_LPUART11_RX                      NXP_SIUL2_PINMUX(0, 0, 75, 0, 198, 1)
#define PTF27_LPUART11_TX_O                    NXP_SIUL2_PINMUX(0, 0, 187, 1, 0, 0)
#define PTF27_LPUART11_TX_I                    NXP_SIUL2_PINMUX(0, 0, 187, 0, 412, 3)
#define PTF28_LPUART11_RX                      NXP_SIUL2_PINMUX(0, 0, 188, 0, 198, 3)
#define PTH10_LPUART11_TX_O                    NXP_SIUL2_PINMUX(0, 0, 234, 1, 0, 0)
#define PTH10_LPUART11_TX_I                    NXP_SIUL2_PINMUX(0, 0, 234, 0, 412, 4)
#define PTH11_LPUART11_RX                      NXP_SIUL2_PINMUX(0, 0, 235, 0, 198, 4)

/* LPUART6 */
#define PTA15_LPUART6_RX                       NXP_SIUL2_PINMUX(0, 0, 15, 0, 193, 2)
#define PTA16_LPUART6_TX_O                     NXP_SIUL2_PINMUX(0, 0, 16, 5, 0, 0)
#define PTA16_LPUART6_TX_I                     NXP_SIUL2_PINMUX(0, 0, 16, 0, 369, 1)
#define PTB29_LPUART6_TX_O                     NXP_SIUL2_PINMUX(0, 0, 61, 1, 0, 0)
#define PTB29_LPUART6_TX_I                     NXP_SIUL2_PINMUX(0, 0, 61, 0, 369, 3)
#define PTC18_LPUART6_RX                       NXP_SIUL2_PINMUX(0, 0, 82, 0, 193, 4)
#define PTD8_LPUART6_RX                        NXP_SIUL2_PINMUX(0, 0, 104, 0, 193, 1)
#define PTD9_LPUART6_TX_O                      NXP_SIUL2_PINMUX(0, 0, 105, 4, 0, 0)
#define PTD9_LPUART6_TX_I                      NXP_SIUL2_PINMUX(0, 0, 105, 0, 369, 2)
#define PTF2_LPUART6_TX_O                      NXP_SIUL2_PINMUX(0, 0, 162, 1, 0, 0)
#define PTF2_LPUART6_TX_I                      NXP_SIUL2_PINMUX(0, 0, 162, 0, 369, 4)
#define PTF3_LPUART6_RX                        NXP_SIUL2_PINMUX(0, 0, 163, 0, 193, 3)

/* LPUART4 */
#define PTA17_LPUART4_TX_O                     NXP_SIUL2_PINMUX(0, 0, 17, 4, 0, 0)
#define PTA17_LPUART4_TX_I                     NXP_SIUL2_PINMUX(0, 0, 17, 0, 367, 1)
#define PTB16_LPUART4_TX_O                     NXP_SIUL2_PINMUX(0, 0, 48, 4, 0, 0)
#define PTB16_LPUART4_TX_I                     NXP_SIUL2_PINMUX(0, 0, 48, 0, 367, 2)
#define PTB17_LPUART4_RX                       NXP_SIUL2_PINMUX(0, 0, 49, 0, 191, 3)
#define PTE7_LPUART4_RX                        NXP_SIUL2_PINMUX(0, 0, 135, 0, 191, 4)
#define PTE10_LPUART4_RX                       NXP_SIUL2_PINMUX(0, 0, 138, 0, 191, 2)
#define PTE11_LPUART4_TX_O                     NXP_SIUL2_PINMUX(0, 0, 139, 1, 0, 0)
#define PTE11_LPUART4_TX_I                     NXP_SIUL2_PINMUX(0, 0, 139, 0, 367, 3)
#define PTH4_LPUART4_TX_O                      NXP_SIUL2_PINMUX(0, 0, 228, 1, 0, 0)
#define PTH4_LPUART4_TX_I                      NXP_SIUL2_PINMUX(0, 0, 228, 0, 367, 4)
#define PTH5_LPUART4_RX                        NXP_SIUL2_PINMUX(0, 0, 229, 0, 191, 5)

/* GMAC0 */
#define PTA26_GMAC0_PPS0_O                     NXP_SIUL2_PINMUX(0, 0, 26, 7, 0, 0)
#define PTA26_GMAC0_PPS0_I                     NXP_SIUL2_PINMUX(0, 0, 26, 0, 144, 3)
#define PTA27_GMAC0_PPS1_O                     NXP_SIUL2_PINMUX(0, 0, 27, 3, 0, 0)
#define PTA27_GMAC0_PPS1_I                     NXP_SIUL2_PINMUX(0, 0, 27, 0, 145, 3)
#define PTA29_GMAC0_PPS2_O                     NXP_SIUL2_PINMUX(0, 0, 29, 3, 0, 0)
#define PTA29_GMAC0_PPS2_I                     NXP_SIUL2_PINMUX(0, 0, 29, 0, 146, 3)
#define PTA31_GMAC0_PPS0_O                     NXP_SIUL2_PINMUX(0, 0, 31, 1, 0, 0)
#define PTA31_GMAC0_PPS0_I                     NXP_SIUL2_PINMUX(0, 0, 31, 0, 144, 5)
#define PTB3_GMAC0_MII_RGMII_TXD3              NXP_SIUL2_PINMUX(0, 0, 35, 8, 0, 0)
#define PTB3_GMAC0_MII_RMII_RGMII_TX_CLK_O     NXP_SIUL2_PINMUX(0, 0, 35, 9, 0, 0)
#define PTB3_GMAC0_MII_RMII_RGMII_TX_CLK_I     NXP_SIUL2_PINMUX(0, 0, 35, 0, 296, 5)
#define PTB4_GMAC0_MII_RMII_TXD1               NXP_SIUL2_PINMUX(0, 0, 36, 1, 0, 0)
#define PTB4_GMAC0_MII_RMII_RGMII_MDIO_O       NXP_SIUL2_PINMUX(0, 0, 36, 5, 0, 0)
#define PTB4_GMAC0_MII_RMII_RGMII_MDIO_I       NXP_SIUL2_PINMUX(0, 0, 36, 0, 291, 1)
#define PTB5_GMAC0_MII_RMII_TXD0               NXP_SIUL2_PINMUX(0, 0, 37, 1, 0, 0)
#define PTB5_GMAC0_MII_RMII_RGMII_MDC          NXP_SIUL2_PINMUX(0, 0, 37, 7, 0, 0)
#define PTB18_GMAC0_MII_RMII_RX_DV_RGMII_RXCTL NXP_SIUL2_PINMUX(0, 0, 50, 0, 292, 4)
#define PTB19_GMAC0_PPS0_O                     NXP_SIUL2_PINMUX(0, 0, 51, 1, 0, 0)
#define PTB19_GMAC0_MII_RMII_TX_EN             NXP_SIUL2_PINMUX(0, 0, 51, 4, 0, 0)
#define PTB19_GMAC0_PPS0_I                     NXP_SIUL2_PINMUX(0, 0, 51, 0, 144, 4)
#define PTB22_GMAC0_MII_CRS                    NXP_SIUL2_PINMUX(0, 0, 54, 0, 290, 1)
#define PTB22_GMAC0_MII_RMII_RX_DV_RGMII_RXCTL NXP_SIUL2_PINMUX(0, 0, 54, 0, 292, 5)
#define PTB22_GMAC0_MII_RGMII_RX_CLK           NXP_SIUL2_PINMUX(0, 0, 54, 0, 300, 7)
#define PTB23_GMAC0_MII_COL                    NXP_SIUL2_PINMUX(0, 0, 55, 0, 289, 1)
#define PTB23_GMAC0_MII_RMII_RGMII_RXD0        NXP_SIUL2_PINMUX(0, 0, 55, 0, 294, 5)
#define PTB23_GMAC0_MII_RMII_RGMII_RXD1        NXP_SIUL2_PINMUX(0, 0, 55, 0, 295, 5)
#define PTB23_GMAC0_MII_RGMII_RXD2             NXP_SIUL2_PINMUX(0, 0, 55, 0, 301, 5)
#define PTB24_GMAC0_MII_RMII_RGMII_RXD1        NXP_SIUL2_PINMUX(0, 0, 56, 0, 295, 4)
#define PTB24_GMAC0_MII_RGMII_RXD2             NXP_SIUL2_PINMUX(0, 0, 56, 0, 301, 4)
#define PTB24_GMAC0_MII_RGMII_RXD3             NXP_SIUL2_PINMUX(0, 0, 56, 0, 302, 3)
#define PTB25_GMAC0_RGMII_TXCTL                NXP_SIUL2_PINMUX(0, 0, 57, 6, 0, 0)
#define PTB28_GMAC0_MII_RGMII_TXD2             NXP_SIUL2_PINMUX(0, 0, 60, 2, 0, 0)
#define PTB28_GMAC0_PPS3_O                     NXP_SIUL2_PINMUX(0, 0, 60, 7, 0, 0)
#define PTB28_GMAC0_MII_RGMII_TXD3             NXP_SIUL2_PINMUX(0, 0, 60, 8, 0, 0)
#define PTB28_GMAC0_PPS3_I                     NXP_SIUL2_PINMUX(0, 0, 60, 0, 147, 2)
#define PTB29_GMAC0_MII_RMII_RGMII_TXD0        NXP_SIUL2_PINMUX(0, 0, 61, 2, 0, 0)
#define PTB29_GMAC0_MII_RMII_RGMII_TXD1        NXP_SIUL2_PINMUX(0, 0, 61, 8, 0, 0)
#define PTB29_GMAC0_MII_RGMII_TXD2             NXP_SIUL2_PINMUX(0, 0, 61, 9, 0, 0)
#define PTC0_GMAC0_MII_RMII_RXD0               NXP_SIUL2_PINMUX(0, 0, 64, 0, 294, 2)
#define PTC0_GMAC0_MII_RMII_RXD1               NXP_SIUL2_PINMUX(0, 0, 64, 0, 295, 1)
#define PTC0_GMAC0_MII_RMII_TX_CLK             NXP_SIUL2_PINMUX(0, 0, 64, 0, 296, 4)
#define PTC1_GMAC0_MII_RMII_RXD0               NXP_SIUL2_PINMUX(0, 0, 65, 0, 294, 1)
#define PTC1_GMAC0_MII_RMII_RXD1               NXP_SIUL2_PINMUX(0, 0, 65, 0, 295, 2)
#define PTC1_GMAC0_MII_RX_CLK                  NXP_SIUL2_PINMUX(0, 0, 65, 0, 300, 3)
#define PTC2_GMAC0_MII_RMII_TXD1               NXP_SIUL2_PINMUX(0, 0, 66, 1, 0, 0)
#define PTC2_GMAC0_MII_RMII_TXD0               NXP_SIUL2_PINMUX(0, 0, 66, 5, 0, 0)
#define PTC14_GMAC0_MII_COL                    NXP_SIUL2_PINMUX(0, 0, 78, 0, 289, 2)
#define PTC14_GMAC0_MII_RMII_RX_ER             NXP_SIUL2_PINMUX(0, 0, 78, 0, 293, 2)
#define PTC14_GMAC0_MII_RMII_RGMII_RXD0        NXP_SIUL2_PINMUX(0, 0, 78, 0, 294, 4)
#define PTC14_GMAC0_MII_RGMII_RXD2             NXP_SIUL2_PINMUX(0, 0, 78, 0, 301, 3)
#define PTC14_GMAC0_MII_RGMII_RXD3             NXP_SIUL2_PINMUX(0, 0, 78, 0, 302, 2)
#define PTC15_GMAC0_MII_CRS                    NXP_SIUL2_PINMUX(0, 0, 79, 0, 290, 2)
#define PTC15_GMAC0_MII_RMII_RX_DV_RGMII_RXCTL NXP_SIUL2_PINMUX(0, 0, 79, 0, 292, 2)
#define PTC15_GMAC0_MII_RMII_RGMII_RXD0        NXP_SIUL2_PINMUX(0, 0, 79, 0, 294, 6)
#define PTC15_GMAC0_MII_RMII_RGMII_RXD1        NXP_SIUL2_PINMUX(0, 0, 79, 0, 295, 6)
#define PTC15_GMAC0_MII_RGMII_RXD2             NXP_SIUL2_PINMUX(0, 0, 79, 0, 301, 2)
#define PTC15_GMAC0_MII_RGMII_RXD3             NXP_SIUL2_PINMUX(0, 0, 79, 0, 302, 4)
#define PTC16_GMAC0_MII_RMII_RX_DV_RGMII_RXCTL NXP_SIUL2_PINMUX(0, 0, 80, 0, 292, 6)
#define PTC16_GMAC0_MII_RMII_RX_ER             NXP_SIUL2_PINMUX(0, 0, 80, 0, 293, 1)
#define PTC16_GMAC0_MII_RGMII_RX_CLK           NXP_SIUL2_PINMUX(0, 0, 80, 0, 300, 6)
#define PTC17_GMAC0_MII_RMII_RX_DV_RGMII_RXCTL NXP_SIUL2_PINMUX(0, 0, 81, 0, 292, 1)
#define PTC18_GMAC0_MII_RMII_RGMII_TXD0        NXP_SIUL2_PINMUX(0, 0, 82, 1, 0, 0)
#define PTC18_GMAC0_MII_RMII_RGMII_TXD1        NXP_SIUL2_PINMUX(0, 0, 82, 5, 0, 0)
#define PTC18_GMAC0_MII_RGMII_TXD2             NXP_SIUL2_PINMUX(0, 0, 82, 8, 0, 0)
#define PTC19_GMAC0_MII_RMII_RGMII_TX_CLK_O    NXP_SIUL2_PINMUX(0, 0, 83, 8, 0, 0)
#define PTC19_GMAC0_MII_RMII_RGMII_TXD0        NXP_SIUL2_PINMUX(0, 0, 83, 9, 0, 0)
#define PTC19_GMAC0_MII_RMII_RGMII_TX_CLK_I    NXP_SIUL2_PINMUX(0, 0, 83, 0, 296, 6)
#define PTC20_GMAC0_PPS0_O                     NXP_SIUL2_PINMUX(0, 0, 84, 7, 0, 0)
#define PTC20_GMAC0_PPS0_I                     NXP_SIUL2_PINMUX(0, 0, 84, 0, 144, 6)
#define PTC21_GMAC0_PPS1_O                     NXP_SIUL2_PINMUX(0, 0, 85, 1, 0, 0)
#define PTC21_GMAC0_PPS1_I                     NXP_SIUL2_PINMUX(0, 0, 85, 0, 145, 4)
#define PTD5_GMAC0_MII_TXD2                    NXP_SIUL2_PINMUX(0, 0, 101, 1, 0, 0)
#define PTD5_GMAC0_MII_TXD3                    NXP_SIUL2_PINMUX(0, 0, 101, 5, 0, 0)
#define PTD5_GMAC0_MII_RX_CLK                  NXP_SIUL2_PINMUX(0, 0, 101, 0, 300, 2)
#define PTD6_GMAC0_MII_TXD3                    NXP_SIUL2_PINMUX(0, 0, 102, 1, 0, 0)
#define PTD6_GMAC0_MII_TXD2                    NXP_SIUL2_PINMUX(0, 0, 102, 5, 0, 0)
#define PTD6_GMAC0_MII_RMII_TX_CLK             NXP_SIUL2_PINMUX(0, 0, 102, 0, 296, 2)
#define PTD7_GMAC0_MII_RMII_TXD0               NXP_SIUL2_PINMUX(0, 0, 103, 1, 0, 0)
#define PTD7_GMAC0_MII_RMII_TXD1               NXP_SIUL2_PINMUX(0, 0, 103, 5, 0, 0)
#define PTD8_GMAC0_MII_RMII_RXD1               NXP_SIUL2_PINMUX(0, 0, 104, 0, 295, 3)
#define PTD8_GMAC0_MII_RXD3                    NXP_SIUL2_PINMUX(0, 0, 104, 0, 302, 1)
#define PTD9_GMAC0_MII_RMII_RXD0               NXP_SIUL2_PINMUX(0, 0, 105, 0, 294, 3)
#define PTD9_GMAC0_MII_RXD2                    NXP_SIUL2_PINMUX(0, 0, 105, 0, 301, 1)
#define PTD10_GMAC0_MII_TXD3                   NXP_SIUL2_PINMUX(0, 0, 106, 1, 0, 0)
#define PTD10_GMAC0_MII_RX_CLK                 NXP_SIUL2_PINMUX(0, 0, 106, 0, 300, 1)
#define PTD11_GMAC0_MII_TXD2                   NXP_SIUL2_PINMUX(0, 0, 107, 1, 0, 0)
#define PTD11_GMAC0_MII_RMII_TX_EN             NXP_SIUL2_PINMUX(0, 0, 107, 3, 0, 0)
#define PTD11_GMAC0_MII_RMII_TX_CLK            NXP_SIUL2_PINMUX(0, 0, 107, 0, 296, 1)
#define PTD12_GMAC0_MII_RMII_TX_EN             NXP_SIUL2_PINMUX(0, 0, 108, 5, 0, 0)
#define PTD12_GMAC0_MII_RMII_TX_CLK            NXP_SIUL2_PINMUX(0, 0, 108, 0, 296, 3)
#define PTD13_GMAC0_PPS1_O                     NXP_SIUL2_PINMUX(0, 0, 109, 5, 0, 0)
#define PTD13_GMAC0_PPS1_I                     NXP_SIUL2_PINMUX(0, 0, 109, 0, 145, 2)
#define PTD14_GMAC0_PPS0_O                     NXP_SIUL2_PINMUX(0, 0, 110, 5, 0, 0)
#define PTD14_GMAC0_PPS0_I                     NXP_SIUL2_PINMUX(0, 0, 110, 0, 144, 2)
#define PTD14_GMAC0_MII_RMII_RX_DV_RGMII_RXCTL NXP_SIUL2_PINMUX(0, 0, 110, 0, 292, 3)
#define PTD15_GMAC0_PPS2_O                     NXP_SIUL2_PINMUX(0, 0, 111, 5, 0, 0)
#define PTD15_GMAC0_PPS2_I                     NXP_SIUL2_PINMUX(0, 0, 111, 0, 146, 2)
#define PTD16_GMAC0_MII_RMII_RGMII_MDIO_O      NXP_SIUL2_PINMUX(0, 0, 112, 3, 0, 0)
#define PTD16_GMAC0_MII_RMII_RGMII_MDIO_I      NXP_SIUL2_PINMUX(0, 0, 112, 0, 291, 2)
#define PTD17_GMAC0_MII_RMII_RGMII_MDC         NXP_SIUL2_PINMUX(0, 0, 113, 3, 0, 0)
#define PTD17_GMAC0_PPS2_O                     NXP_SIUL2_PINMUX(0, 0, 113, 7, 0, 0)
#define PTD17_GMAC0_PPS2_I                     NXP_SIUL2_PINMUX(0, 0, 113, 0, 146, 1)
#define PTE3_GMAC0_PPS0_O                      NXP_SIUL2_PINMUX(0, 0, 131, 6, 0, 0)
#define PTE3_GMAC0_PPS0_I                      NXP_SIUL2_PINMUX(0, 0, 131, 0, 144, 1)
#define PTE8_GMAC0_MII_RMII_RGMII_MDC          NXP_SIUL2_PINMUX(0, 0, 136, 5, 0, 0)
#define PTE9_GMAC0_PPS3_O                      NXP_SIUL2_PINMUX(0, 0, 137, 5, 0, 0)
#define PTE9_GMAC0_MII_RMII_TX_EN              NXP_SIUL2_PINMUX(0, 0, 137, 6, 0, 0)
#define PTE9_GMAC0_PPS3_I                      NXP_SIUL2_PINMUX(0, 0, 137, 0, 147, 1)
#define PTE12_GMAC0_PPS3_O                     NXP_SIUL2_PINMUX(0, 0, 140, 5, 0, 0)
#define PTE12_GMAC0_PPS3_I                     NXP_SIUL2_PINMUX(0, 0, 140, 0, 147, 3)
#define PTE14_GMAC0_PPS1_O                     NXP_SIUL2_PINMUX(0, 0, 142, 7, 0, 0)
#define PTE14_GMAC0_PPS1_I                     NXP_SIUL2_PINMUX(0, 0, 142, 0, 145, 1)

/* USDHC */
#define PTA28_USDHC_D1_O                       NXP_SIUL2_PINMUX(0, 0, 28, 5, 0, 0)
#define PTA28_USDHC_D3_O                       NXP_SIUL2_PINMUX(0, 0, 28, 7, 0, 0)
#define PTA28_USDHC_D0_O                       NXP_SIUL2_PINMUX(0, 0, 28, 8, 0, 0)
#define PTA28_USDHC_D2_O                       NXP_SIUL2_PINMUX(0, 0, 28, 9, 0, 0)
#define PTA28_USDHC_D5_O                       NXP_SIUL2_PINMUX(0, 0, 28, 10, 0, 0)
#define PTA28_USDHC_D0_I                       NXP_SIUL2_PINMUX(0, 0, 28, 0, 427, 3)
#define PTA28_USDHC_D1_I                       NXP_SIUL2_PINMUX(0, 0, 28, 0, 428, 3)
#define PTA28_USDHC_D2_I                       NXP_SIUL2_PINMUX(0, 0, 28, 0, 429, 4)
#define PTA28_USDHC_D3_I                       NXP_SIUL2_PINMUX(0, 0, 28, 0, 430, 3)
#define PTA28_USDHC_D5_I                       NXP_SIUL2_PINMUX(0, 0, 28, 0, 432, 1)
#define PTA29_USDHC_D0_O                       NXP_SIUL2_PINMUX(0, 0, 29, 1, 0, 0)
#define PTA29_USDHC_D2_O                       NXP_SIUL2_PINMUX(0, 0, 29, 7, 0, 0)
#define PTA29_USDHC_D1_O                       NXP_SIUL2_PINMUX(0, 0, 29, 8, 0, 0)
#define PTA29_USDHC_D3_O                       NXP_SIUL2_PINMUX(0, 0, 29, 9, 0, 0)
#define PTA29_USDHC_D5_O                       NXP_SIUL2_PINMUX(0, 0, 29, 10, 0, 0)
#define PTA29_USDHC_D0_I                       NXP_SIUL2_PINMUX(0, 0, 29, 0, 427, 2)
#define PTA29_USDHC_D1_I                       NXP_SIUL2_PINMUX(0, 0, 29, 0, 428, 4)
#define PTA29_USDHC_D2_I                       NXP_SIUL2_PINMUX(0, 0, 29, 0, 429, 2)
#define PTA29_USDHC_D3_I                       NXP_SIUL2_PINMUX(0, 0, 29, 0, 430, 4)
#define PTA29_USDHC_D5_I                       NXP_SIUL2_PINMUX(0, 0, 29, 0, 432, 2)
#define PTA30_USDHC_CLK_O                      NXP_SIUL2_PINMUX(0, 0, 30, 1, 0, 0)
#define PTA30_USDHC_D4_O                       NXP_SIUL2_PINMUX(0, 0, 30, 7, 0, 0)
#define PTA30_USDHC_D1_O                       NXP_SIUL2_PINMUX(0, 0, 30, 8, 0, 0)
#define PTA30_USDHC_D2_O                       NXP_SIUL2_PINMUX(0, 0, 30, 9, 0, 0)
#define PTA30_USDHC_CLK_I                      NXP_SIUL2_PINMUX(0, 0, 30, 0, 425, 2)
#define PTA30_USDHC_D1_I                       NXP_SIUL2_PINMUX(0, 0, 30, 0, 428, 5)
#define PTA30_USDHC_D2_I                       NXP_SIUL2_PINMUX(0, 0, 30, 0, 429, 5)
#define PTA30_USDHC_D4_I                       NXP_SIUL2_PINMUX(0, 0, 30, 0, 431, 1)
#define PTA31_USDHC_CMD_O                      NXP_SIUL2_PINMUX(0, 0, 31, 5, 0, 0)
#define PTA31_USDHC_D0_O                       NXP_SIUL2_PINMUX(0, 0, 31, 6, 0, 0)
#define PTA31_USDHC_D3_O                       NXP_SIUL2_PINMUX(0, 0, 31, 8, 0, 0)
#define PTA31_USDHC_CMD_I                      NXP_SIUL2_PINMUX(0, 0, 31, 0, 426, 1)
#define PTA31_USDHC_D0_I                       NXP_SIUL2_PINMUX(0, 0, 31, 0, 427, 4)
#define PTA31_USDHC_D3_I                       NXP_SIUL2_PINMUX(0, 0, 31, 0, 430, 5)
#define PTB18_USDHC_D1_O                       NXP_SIUL2_PINMUX(0, 0, 50, 9, 0, 0)
#define PTB18_USDHC_D1_I                       NXP_SIUL2_PINMUX(0, 0, 50, 0, 428, 6)
#define PTB19_USDHC_D3_O                       NXP_SIUL2_PINMUX(0, 0, 51, 6, 0, 0)
#define PTB19_USDHC_D2_O                       NXP_SIUL2_PINMUX(0, 0, 51, 8, 0, 0)
#define PTB19_USDHC_D2_I                       NXP_SIUL2_PINMUX(0, 0, 51, 0, 429, 3)
#define PTB19_USDHC_D3_I                       NXP_SIUL2_PINMUX(0, 0, 51, 0, 430, 6)
#define PTB20_USDHC_CLK_O                      NXP_SIUL2_PINMUX(0, 0, 52, 6, 0, 0)
#define PTB20_USDHC_D2_O                       NXP_SIUL2_PINMUX(0, 0, 52, 8, 0, 0)
#define PTB20_USDHC_D7_O                       NXP_SIUL2_PINMUX(0, 0, 52, 9, 0, 0)
#define PTB20_USDHC_CMD_O                      NXP_SIUL2_PINMUX(0, 0, 52, 10, 0, 0)
#define PTB20_USDHC_CLK_I                      NXP_SIUL2_PINMUX(0, 0, 52, 0, 425, 4)
#define PTB20_USDHC_CMD_I                      NXP_SIUL2_PINMUX(0, 0, 52, 0, 426, 4)
#define PTB20_USDHC_D2_I                       NXP_SIUL2_PINMUX(0, 0, 52, 0, 429, 6)
#define PTB20_USDHC_D7_I                       NXP_SIUL2_PINMUX(0, 0, 52, 0, 434, 1)
#define PTB21_USDHC_D6_O                       NXP_SIUL2_PINMUX(0, 0, 53, 4, 0, 0)
#define PTB21_USDHC_CMD_O                      NXP_SIUL2_PINMUX(0, 0, 53, 8, 0, 0)
#define PTB21_USDHC_CMD_I                      NXP_SIUL2_PINMUX(0, 0, 53, 0, 426, 2)
#define PTB21_USDHC_D6_I                       NXP_SIUL2_PINMUX(0, 0, 53, 0, 433, 1)
#define PTB26_USDHC_CMD_O                      NXP_SIUL2_PINMUX(0, 0, 58, 5, 0, 0)
#define PTB26_USDHC_CMD_I                      NXP_SIUL2_PINMUX(0, 0, 58, 0, 426, 3)
#define PTC0_USDHC_D2_O                        NXP_SIUL2_PINMUX(0, 0, 64, 3, 0, 0)
#define PTC0_USDHC_D1_O                        NXP_SIUL2_PINMUX(0, 0, 64, 8, 0, 0)
#define PTC0_USDHC_D0_O                        NXP_SIUL2_PINMUX(0, 0, 64, 9, 0, 0)
#define PTC0_USDHC_D7_O                        NXP_SIUL2_PINMUX(0, 0, 64, 10, 0, 0)
#define PTC0_USDHC_D0_I                        NXP_SIUL2_PINMUX(0, 0, 64, 0, 427, 7)
#define PTC0_USDHC_D1_I                        NXP_SIUL2_PINMUX(0, 0, 64, 0, 428, 1)
#define PTC0_USDHC_D2_I                        NXP_SIUL2_PINMUX(0, 0, 64, 0, 429, 1)
#define PTC0_USDHC_D7_I                        NXP_SIUL2_PINMUX(0, 0, 64, 0, 434, 3)
#define PTC1_USDHC_D0_O                        NXP_SIUL2_PINMUX(0, 0, 65, 1, 0, 0)
#define PTC1_USDHC_D3_O                        NXP_SIUL2_PINMUX(0, 0, 65, 8, 0, 0)
#define PTC1_USDHC_D1_O                        NXP_SIUL2_PINMUX(0, 0, 65, 9, 0, 0)
#define PTC1_USDHC_D2_O                        NXP_SIUL2_PINMUX(0, 0, 65, 10, 0, 0)
#define PTC1_USDHC_D7_O                        NXP_SIUL2_PINMUX(0, 0, 65, 11, 0, 0)
#define PTC1_USDHC_D0_I                        NXP_SIUL2_PINMUX(0, 0, 65, 0, 427, 6)
#define PTC1_USDHC_D1_I                        NXP_SIUL2_PINMUX(0, 0, 65, 0, 428, 8)
#define PTC1_USDHC_D2_I                        NXP_SIUL2_PINMUX(0, 0, 65, 0, 429, 7)
#define PTC1_USDHC_D3_I                        NXP_SIUL2_PINMUX(0, 0, 65, 0, 430, 2)
#define PTC1_USDHC_D7_I                        NXP_SIUL2_PINMUX(0, 0, 65, 0, 434, 2)
#define PTC2_USDHC_D5_O                        NXP_SIUL2_PINMUX(0, 0, 66, 8, 0, 0)
#define PTC2_USDHC_D5_I                        NXP_SIUL2_PINMUX(0, 0, 66, 0, 432, 3)
#define PTC17_USDHC_D3_O                       NXP_SIUL2_PINMUX(0, 0, 81, 9, 0, 0)
#define PTC17_USDHC_D1_O                       NXP_SIUL2_PINMUX(0, 0, 81, 10, 0, 0)
#define PTC17_USDHC_D2_O                       NXP_SIUL2_PINMUX(0, 0, 81, 11, 0, 0)
#define PTC17_USDHC_CMD_O                      NXP_SIUL2_PINMUX(0, 0, 81, 12, 0, 0)
#define PTC17_USDHC_CLK_O                      NXP_SIUL2_PINMUX(0, 0, 81, 14, 0, 0)
#define PTC17_USDHC_CLK_I                      NXP_SIUL2_PINMUX(0, 0, 81, 0, 425, 7)
#define PTC17_USDHC_CMD_I                      NXP_SIUL2_PINMUX(0, 0, 81, 0, 426, 5)
#define PTC17_USDHC_D1_I                       NXP_SIUL2_PINMUX(0, 0, 81, 0, 428, 2)
#define PTC17_USDHC_D2_I                       NXP_SIUL2_PINMUX(0, 0, 81, 0, 429, 9)
#define PTC17_USDHC_D3_I                       NXP_SIUL2_PINMUX(0, 0, 81, 0, 430, 1)
#define PTC21_USDHC_RESET_B                    NXP_SIUL2_PINMUX(0, 0, 85, 8, 0, 0)
#define PTC21_USDHC_WP                         NXP_SIUL2_PINMUX(0, 0, 85, 0, 424, 2)
#define PTD6_USDHC_CLK_O                       NXP_SIUL2_PINMUX(0, 0, 102, 14, 0, 0)
#define PTD6_USDHC_CLK_I                       NXP_SIUL2_PINMUX(0, 0, 102, 0, 425, 5)
#define PTD7_USDHC_D3_O                        NXP_SIUL2_PINMUX(0, 0, 103, 8, 0, 0)
#define PTD7_USDHC_D3_I                        NXP_SIUL2_PINMUX(0, 0, 103, 0, 430, 7)
#define PTD8_USDHC_D3_O                        NXP_SIUL2_PINMUX(0, 0, 104, 9, 0, 0)
#define PTD8_USDHC_D0_O                        NXP_SIUL2_PINMUX(0, 0, 104, 10, 0, 0)
#define PTD8_USDHC_CLK_O                       NXP_SIUL2_PINMUX(0, 0, 104, 11, 0, 0)
#define PTD8_USDHC_CLK_I                       NXP_SIUL2_PINMUX(0, 0, 104, 0, 425, 6)
#define PTD8_USDHC_D0_I                        NXP_SIUL2_PINMUX(0, 0, 104, 0, 427, 1)
#define PTD8_USDHC_D3_I                        NXP_SIUL2_PINMUX(0, 0, 104, 0, 430, 9)
#define PTD9_USDHC_D0_O                        NXP_SIUL2_PINMUX(0, 0, 105, 9, 0, 0)
#define PTD9_USDHC_CLK_O                       NXP_SIUL2_PINMUX(0, 0, 105, 10, 0, 0)
#define PTD9_USDHC_D1_O                        NXP_SIUL2_PINMUX(0, 0, 105, 11, 0, 0)
#define PTD9_USDHC_D2_O                        NXP_SIUL2_PINMUX(0, 0, 105, 12, 0, 0)
#define PTD9_USDHC_D3_O                        NXP_SIUL2_PINMUX(0, 0, 105, 13, 0, 0)
#define PTD9_USDHC_D6_O                        NXP_SIUL2_PINMUX(0, 0, 105, 14, 0, 0)
#define PTD9_USDHC_CLK_I                       NXP_SIUL2_PINMUX(0, 0, 105, 0, 425, 1)
#define PTD9_USDHC_D0_I                        NXP_SIUL2_PINMUX(0, 0, 105, 0, 427, 8)
#define PTD9_USDHC_D1_I                        NXP_SIUL2_PINMUX(0, 0, 105, 0, 428, 9)
#define PTD9_USDHC_D2_I                        NXP_SIUL2_PINMUX(0, 0, 105, 0, 429, 8)
#define PTD9_USDHC_D3_I                        NXP_SIUL2_PINMUX(0, 0, 105, 0, 430, 8)
#define PTD9_USDHC_D6_I                        NXP_SIUL2_PINMUX(0, 0, 105, 0, 433, 2)
#define PTD10_USDHC_D1_O                       NXP_SIUL2_PINMUX(0, 0, 106, 8, 0, 0)
#define PTD10_USDHC_D1_I                       NXP_SIUL2_PINMUX(0, 0, 106, 0, 428, 7)
#define PTD11_USDHC_D0_O                       NXP_SIUL2_PINMUX(0, 0, 107, 8, 0, 0)
#define PTD11_USDHC_D0_I                       NXP_SIUL2_PINMUX(0, 0, 107, 0, 427, 5)
#define PTD12_USDHC_D4_O                       NXP_SIUL2_PINMUX(0, 0, 108, 8, 0, 0)
#define PTD12_USDHC_D4_I                       NXP_SIUL2_PINMUX(0, 0, 108, 0, 431, 2)
#define PTE12_USDHC_RESET_B                    NXP_SIUL2_PINMUX(0, 0, 140, 1, 0, 0)
#define PTE12_USDHC_WP                         NXP_SIUL2_PINMUX(0, 0, 140, 0, 424, 1)

