zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K358_K348_K338_K328_289BGA-pinctrl.h
/* SAI0 */
#define PTA31_SAI0_MCLK                        NXP_SIUL2_PINMUX(0, 0, 31, 0, 320, 3)
#define PTB2_SAI0_D0_O                         NXP_SIUL2_PINMUX(0, 0, 34, 6, 0, 0)
#define PTB2_SAI0_D0_I                         NXP_SIUL2_PINMUX(0, 0, 34, 0, 316, 1)
#define PTB3_SAI0_MCLK                         NXP_SIUL2_PINMUX(0, 0, 35, 0, 320, 1)
#define PTB4_SAI0_D1_O                         NXP_SIUL2_PINMUX(0, 0, 36, 7, 0, 0)
#define PTB4_SAI0_D1_I                         NXP_SIUL2_PINMUX(0, 0, 36, 0, 317, 2)
#define PTB27_SAI0_D0_O                        NXP_SIUL2_PINMUX(0, 0, 59, 6, 0, 0)
#define PTB27_SAI0_D0_I                        NXP_SIUL2_PINMUX(0, 0, 59, 0, 316, 2)
#define PTB29_SAI0_D1_O                        NXP_SIUL2_PINMUX(0, 0, 61, 7, 0, 0)
#define PTB29_SAI0_D1_I                        NXP_SIUL2_PINMUX(0, 0, 61, 0, 317, 1)
#define PTC12_SAI0_BCLK_O                      NXP_SIUL2_PINMUX(0, 0, 76, 7, 0, 0)
#define PTC12_SAI0_BCLK_I                      NXP_SIUL2_PINMUX(0, 0, 76, 0, 315, 1)
#define PTC13_SAI0_SYNC_O                      NXP_SIUL2_PINMUX(0, 0, 77, 7, 0, 0)
#define PTC13_SAI0_SYNC_I                      NXP_SIUL2_PINMUX(0, 0, 77, 0, 321, 1)
#define PTC18_SAI0_D2_O                        NXP_SIUL2_PINMUX(0, 0, 82, 7, 0, 0)
#define PTC18_SAI0_D2_I                        NXP_SIUL2_PINMUX(0, 0, 82, 0, 318, 1)
#define PTC19_SAI0_D3_O                        NXP_SIUL2_PINMUX(0, 0, 83, 7, 0, 0)
#define PTC19_SAI0_D3_I                        NXP_SIUL2_PINMUX(0, 0, 83, 0, 319, 1)
#define PTD5_SAI0_D3_O                         NXP_SIUL2_PINMUX(0, 0, 101, 11, 0, 0)
#define PTD5_SAI0_D3_I                         NXP_SIUL2_PINMUX(0, 0, 101, 0, 319, 2)
#define PTD6_SAI0_D2_O                         NXP_SIUL2_PINMUX(0, 0, 102, 13, 0, 0)
#define PTD6_SAI0_D2_I                         NXP_SIUL2_PINMUX(0, 0, 102, 0, 318, 2)
#define PTD14_SAI0_MCLK                        NXP_SIUL2_PINMUX(0, 0, 110, 0, 320, 4)
#define PTE9_SAI0_MCLK                         NXP_SIUL2_PINMUX(0, 0, 137, 0, 320, 2)

/* LPI2C0 */
#define PTB0_LPI2C0_SDAS_O                     NXP_SIUL2_PINMUX(0, 0, 32, 1, 0, 0)
#define PTB0_LPI2C0_SDAS_I                     NXP_SIUL2_PINMUX(0, 0, 32, 0, 215, 1)
#define PTB1_LPI2C0_SCLS_O                     NXP_SIUL2_PINMUX(0, 0, 33, 1, 0, 0)
#define PTB1_LPI2C0_SCLS_I                     NXP_SIUL2_PINMUX(0, 0, 33, 0, 213, 1)
#define PTB11_LPI2C0_HREQ                      NXP_SIUL2_PINMUX(0, 0, 43, 0, 211, 1)
#define PTC7_LPI2C0_HREQ                       NXP_SIUL2_PINMUX(0, 0, 71, 0, 211, 2)
#define PTC8_LPI2C0_SCL_O                      NXP_SIUL2_PINMUX(0, 0, 72, 1, 0, 0)
#define PTC8_LPI2C0_SCL_I                      NXP_SIUL2_PINMUX(0, 0, 72, 0, 212, 1)
#define PTC9_LPI2C0_SDA_O                      NXP_SIUL2_PINMUX(0, 0, 73, 1, 0, 0)
#define PTC9_LPI2C0_SDA_I                      NXP_SIUL2_PINMUX(0, 0, 73, 0, 214, 1)
#define PTD13_LPI2C0_SDA_O                     NXP_SIUL2_PINMUX(0, 0, 109, 4, 0, 0)
#define PTD13_LPI2C0_SDA_I                     NXP_SIUL2_PINMUX(0, 0, 109, 0, 214, 2)
#define PTD14_LPI2C0_SCL_O                     NXP_SIUL2_PINMUX(0, 0, 110, 4, 0, 0)
#define PTD14_LPI2C0_SCL_I                     NXP_SIUL2_PINMUX(0, 0, 110, 0, 212, 2)
#define PTF20_LPI2C0_SCL_O                     NXP_SIUL2_PINMUX(0, 0, 180, 4, 0, 0)
#define PTF20_LPI2C0_SCL_I                     NXP_SIUL2_PINMUX(0, 0, 180, 0, 212, 3)
#define PTF21_LPI2C0_SDA_O                     NXP_SIUL2_PINMUX(0, 0, 181, 4, 0, 0)
#define PTF21_LPI2C0_SDA_I                     NXP_SIUL2_PINMUX(0, 0, 181, 0, 214, 3)

/* LCU1 */
#define PTB0_LCU1_OUT5                         NXP_SIUL2_PINMUX(0, 0, 32, 5, 0, 0)
#define PTB1_LCU1_OUT4                         NXP_SIUL2_PINMUX(0, 0, 33, 7, 0, 0)
#define PTB2_LCU1_OUT3                         NXP_SIUL2_PINMUX(0, 0, 34, 5, 0, 0)
#define PTB3_LCU1_OUT2                         NXP_SIUL2_PINMUX(0, 0, 35, 6, 0, 0)
#define PTB28_LCU1_OUT11                       NXP_SIUL2_PINMUX(0, 0, 60, 6, 0, 0)
#define PTB29_LCU1_OUT10                       NXP_SIUL2_PINMUX(0, 0, 61, 6, 0, 0)
#define PTC8_LCU1_OUT7                         NXP_SIUL2_PINMUX(0, 0, 72, 5, 0, 0)
#define PTC9_LCU1_OUT6                         NXP_SIUL2_PINMUX(0, 0, 73, 5, 0, 0)
#define PTC10_LCU1_OUT11                       NXP_SIUL2_PINMUX(0, 0, 74, 6, 0, 0)
#define PTC11_LCU1_OUT10                       NXP_SIUL2_PINMUX(0, 0, 75, 7, 0, 0)
#define PTC12_LCU1_OUT9                        NXP_SIUL2_PINMUX(0, 0, 76, 6, 0, 0)
#define PTC13_LCU1_OUT8                        NXP_SIUL2_PINMUX(0, 0, 77, 6, 0, 0)
#define PTC14_LCU1_OUT1                        NXP_SIUL2_PINMUX(0, 0, 78, 6, 0, 0)
#define PTC15_LCU1_OUT0                        NXP_SIUL2_PINMUX(0, 0, 79, 6, 0, 0)
#define PTC18_LCU1_OUT7                        NXP_SIUL2_PINMUX(0, 0, 82, 6, 0, 0)
#define PTC19_LCU1_OUT6                        NXP_SIUL2_PINMUX(0, 0, 83, 6, 0, 0)
#define PTC20_LCU1_OUT5                        NXP_SIUL2_PINMUX(0, 0, 84, 6, 0, 0)
#define PTC21_LCU1_OUT4                        NXP_SIUL2_PINMUX(0, 0, 85, 6, 0, 0)
#define PTC23_LCU1_OUT0                        NXP_SIUL2_PINMUX(0, 0, 87, 6, 0, 0)
#define PTC24_LCU1_OUT1                        NXP_SIUL2_PINMUX(0, 0, 88, 6, 0, 0)
#define PTC25_LCU1_OUT2                        NXP_SIUL2_PINMUX(0, 0, 89, 6, 0, 0)
#define PTC26_LCU1_OUT9                        NXP_SIUL2_PINMUX(0, 0, 90, 6, 0, 0)
#define PTC27_LCU1_OUT3                        NXP_SIUL2_PINMUX(0, 0, 91, 6, 0, 0)
#define PTC28_LCU1_OUT8                        NXP_SIUL2_PINMUX(0, 0, 92, 6, 0, 0)

/* HSE */
#define PTB0_HSE_TAMPER_LOOP_OUT0              NXP_SIUL2_PINMUX(0, 0, 32, 7, 0, 0)
#define PTB1_HSE_TAMPER_EXTIN0                 NXP_SIUL2_PINMUX(0, 0, 33, 0, 343, 1)
#define PTB30_HSE_TAMPER_LOOP_OUT0             NXP_SIUL2_PINMUX(0, 0, 62, 5, 0, 0)
#define PTB31_HSE_TAMPER_EXTIN0                NXP_SIUL2_PINMUX(0, 0, 63, 0, 343, 3)
#define PTD23_HSE_TAMPER_LOOP_OUT0             NXP_SIUL2_PINMUX(0, 0, 119, 5, 0, 0)
#define PTD24_HSE_TAMPER_EXTIN0                NXP_SIUL2_PINMUX(0, 0, 120, 0, 343, 2)
#define PTF11_HSE_TAMPER_EXTIN0                NXP_SIUL2_PINMUX(0, 0, 171, 0, 343, 4)
#define PTF19_HSE_TAMPER_LOOP_OUT0             NXP_SIUL2_PINMUX(0, 0, 179, 6, 0, 0)

/* ADC1 */
#define PTB2_ADC1_MA0                          NXP_SIUL2_PINMUX(0, 0, 34, 1, 0, 0)
#define PTB23_ADC1_MA0                         NXP_SIUL2_PINMUX(0, 0, 55, 1, 0, 0)
#define PTB24_ADC1_MA1                         NXP_SIUL2_PINMUX(0, 0, 56, 1, 0, 0)
#define PTB28_ADC1_MA2                         NXP_SIUL2_PINMUX(0, 0, 60, 1, 0, 0)
#define PTC12_ADC1_MA2                         NXP_SIUL2_PINMUX(0, 0, 76, 1, 0, 0)
#define PTC13_ADC1_MA1                         NXP_SIUL2_PINMUX(0, 0, 77, 4, 0, 0)
#define PTC20_ADC1_MA2                         NXP_SIUL2_PINMUX(0, 0, 84, 5, 0, 0)
#define PTC21_ADC1_MA1                         NXP_SIUL2_PINMUX(0, 0, 85, 5, 0, 0)
#define PTC27_ADC1_MA0                         NXP_SIUL2_PINMUX(0, 0, 91, 5, 0, 0)
#define PTF16_ADC1_MA0                         NXP_SIUL2_PINMUX(0, 0, 176, 4, 0, 0)
#define PTF17_ADC1_MA1                         NXP_SIUL2_PINMUX(0, 0, 177, 4, 0, 0)
#define PTF18_ADC1_MA2                         NXP_SIUL2_PINMUX(0, 0, 178, 4, 0, 0)
#define PTF29_ADC1_MA0                         NXP_SIUL2_PINMUX(0, 0, 189, 4, 0, 0)
#define PTF30_ADC1_MA1                         NXP_SIUL2_PINMUX(0, 0, 190, 4, 0, 0)
#define PTF31_ADC1_MA2                         NXP_SIUL2_PINMUX(0, 0, 191, 1, 0, 0)

/* CAN4 */
#define PTB2_CAN4_RX                           NXP_SIUL2_PINMUX(0, 0, 34, 0, 4, 2)
#define PTB3_CAN4_TX                           NXP_SIUL2_PINMUX(0, 0, 35, 5, 0, 0)
#define PTB29_CAN4_RX                          NXP_SIUL2_PINMUX(0, 0, 61, 0, 4, 6)
#define PTC30_CAN4_TX                          NXP_SIUL2_PINMUX(0, 0, 94, 1, 0, 0)
#define PTC31_CAN4_RX                          NXP_SIUL2_PINMUX(0, 0, 95, 0, 4, 3)
#define PTE3_CAN4_TX                           NXP_SIUL2_PINMUX(0, 0, 131, 1, 0, 0)
#define PTE14_CAN4_RX                          NXP_SIUL2_PINMUX(0, 0, 142, 0, 4, 1)
#define PTE30_CAN4_TX                          NXP_SIUL2_PINMUX(0, 0, 158, 1, 0, 0)
#define PTE31_CAN4_RX                          NXP_SIUL2_PINMUX(0, 0, 159, 0, 4, 4)
#define PTG8_CAN4_TX                           NXP_SIUL2_PINMUX(0, 0, 200, 1, 0, 0)
#define PTG9_CAN4_RX                           NXP_SIUL2_PINMUX(0, 0, 201, 0, 4, 5)

/* LPUART9 */
#define PTB2_LPUART9_RX                        NXP_SIUL2_PINMUX(0, 0, 34, 0, 196, 2)
#define PTB3_LPUART9_TX_O                      NXP_SIUL2_PINMUX(0, 0, 35, 1, 0, 0)
#define PTB3_LPUART9_TX_I                      NXP_SIUL2_PINMUX(0, 0, 35, 0, 410, 1)
#define PTB9_LPUART9_RX                        NXP_SIUL2_PINMUX(0, 0, 41, 0, 196, 1)
#define PTB10_LPUART9_TX_O                     NXP_SIUL2_PINMUX(0, 0, 42, 5, 0, 0)
#define PTB10_LPUART9_TX_I                     NXP_SIUL2_PINMUX(0, 0, 42, 0, 410, 2)
#define PTF23_LPUART9_TX_O                     NXP_SIUL2_PINMUX(0, 0, 183, 1, 0, 0)
#define PTF23_LPUART9_TX_I                     NXP_SIUL2_PINMUX(0, 0, 183, 0, 410, 3)
#define PTF24_LPUART9_RX                       NXP_SIUL2_PINMUX(0, 0, 184, 0, 196, 3)

/* QUADSPI */
#define PTB2_QUADSPI_INTA                      NXP_SIUL2_PINMUX(0, 0, 34, 0, 437, 5)
#define PTB20_QUADSPI_INTA                     NXP_SIUL2_PINMUX(0, 0, 52, 0, 437, 1)
#define PTB26_QUADSPI_INTA                     NXP_SIUL2_PINMUX(0, 0, 58, 0, 437, 8)
#define PTB27_QUADSPI_INTA                     NXP_SIUL2_PINMUX(0, 0, 59, 0, 437, 2)
#define PTC0_QUADSPI_IOFA4_O                   NXP_SIUL2_PINMUX(0, 0, 64, 4, 0, 0)
#define PTC0_QUADSPI_IOFA4_I                   NXP_SIUL2_PINMUX(0, 0, 64, 0, 419, 1)
#define PTC1_QUADSPI_DQSFA_O                   NXP_SIUL2_PINMUX(0, 0, 65, 3, 0, 0)
#define PTC1_QUADSPI_DQSFA_I                   NXP_SIUL2_PINMUX(0, 0, 65, 0, 423, 1)
#define PTC2_QUADSPI_IOFA3_O                   NXP_SIUL2_PINMUX(0, 0, 66, 7, 0, 0)
#define PTC2_QUADSPI_IOFA3_I                   NXP_SIUL2_PINMUX(0, 0, 66, 0, 308, 1)
#define PTC3_QUADSPI_PCSFA                     NXP_SIUL2_PINMUX(0, 0, 67, 6, 0, 0)
#define PTC13_QUADSPI_INTA                     NXP_SIUL2_PINMUX(0, 0, 77, 0, 437, 3)
#define PTC17_QUADSPI_IOFA7_O                  NXP_SIUL2_PINMUX(0, 0, 81, 8, 0, 0)
#define PTC17_QUADSPI_IOFA7_I                  NXP_SIUL2_PINMUX(0, 0, 81, 0, 422, 1)
#define PTC20_QUADSPI_INTA                     NXP_SIUL2_PINMUX(0, 0, 84, 0, 437, 6)
#define PTC23_QUADSPI_INTA                     NXP_SIUL2_PINMUX(0, 0, 87, 0, 437, 7)
#define PTD7_QUADSPI_IOFA1_O                   NXP_SIUL2_PINMUX(0, 0, 103, 7, 0, 0)
#define PTD7_QUADSPI_IOFA1_I                   NXP_SIUL2_PINMUX(0, 0, 103, 0, 306, 1)
#define PTD8_QUADSPI_IOFA6_O                   NXP_SIUL2_PINMUX(0, 0, 104, 8, 0, 0)
#define PTD8_QUADSPI_IOFA6_I                   NXP_SIUL2_PINMUX(0, 0, 104, 0, 421, 1)
#define PTD9_QUADSPI_IOFA5_O                   NXP_SIUL2_PINMUX(0, 0, 105, 8, 0, 0)
#define PTD9_QUADSPI_IOFA5_I                   NXP_SIUL2_PINMUX(0, 0, 105, 0, 420, 1)
#define PTD10_QUADSPI_SCKFA_O                  NXP_SIUL2_PINMUX(0, 0, 106, 7, 0, 0)
#define PTD10_QUADSPI_SCKFA_I                  NXP_SIUL2_PINMUX(0, 0, 106, 0, 309, 1)
#define PTD11_QUADSPI_IOFA0_O                  NXP_SIUL2_PINMUX(0, 0, 107, 7, 0, 0)
#define PTD11_QUADSPI_IOFA0_I                  NXP_SIUL2_PINMUX(0, 0, 107, 0, 305, 1)
#define PTD12_QUADSPI_IOFA2_O                  NXP_SIUL2_PINMUX(0, 0, 108, 7, 0, 0)
#define PTD12_QUADSPI_IOFA2_I                  NXP_SIUL2_PINMUX(0, 0, 108, 0, 307, 1)
#define PTD14_QUADSPI_INTA                     NXP_SIUL2_PINMUX(0, 0, 110, 0, 437, 9)
#define PTE12_QUADSPI_INTA                     NXP_SIUL2_PINMUX(0, 0, 140, 0, 437, 4)

/* ADC0 */
#define PTB3_ADC0_MA0                          NXP_SIUL2_PINMUX(0, 0, 35, 4, 0, 0)
#define PTC6_ADC0_MA2                          NXP_SIUL2_PINMUX(0, 0, 70, 7, 0, 0)
#define PTC14_ADC0_MA1                         NXP_SIUL2_PINMUX(0, 0, 78, 4, 0, 0)
#define PTC15_ADC0_MA2                         NXP_SIUL2_PINMUX(0, 0, 79, 4, 0, 0)
#define PTE2_ADC0_MA0                          NXP_SIUL2_PINMUX(0, 0, 130, 7, 0, 0)
#define PTE6_ADC0_MA1                          NXP_SIUL2_PINMUX(0, 0, 134, 7, 0, 0)
#define PTF9_ADC0_MA0                          NXP_SIUL2_PINMUX(0, 0, 169, 3, 0, 0)
#define PTF10_ADC0_MA1                         NXP_SIUL2_PINMUX(0, 0, 170, 3, 0, 0)
#define PTF11_ADC0_MA2                         NXP_SIUL2_PINMUX(0, 0, 171, 3, 0, 0)
#define PTF12_ADC0_MA0                         NXP_SIUL2_PINMUX(0, 0, 172, 3, 0, 0)
#define PTF13_ADC0_MA1                         NXP_SIUL2_PINMUX(0, 0, 173, 3, 0, 0)
#define PTF19_ADC0_MA2                         NXP_SIUL2_PINMUX(0, 0, 179, 4, 0, 0)

/* LPUART8 */
#define PTB12_LPUART8_RX                       NXP_SIUL2_PINMUX(0, 0, 44, 0, 195, 1)
#define PTB13_LPUART8_TX_O                     NXP_SIUL2_PINMUX(0, 0, 45, 6, 0, 0)
#define PTB13_LPUART8_TX_I                     NXP_SIUL2_PINMUX(0, 0, 45, 0, 409, 1)
#define PTD15_LPUART8_RX                       NXP_SIUL2_PINMUX(0, 0, 111, 0, 195, 2)
#define PTD16_LPUART8_TX_O                     NXP_SIUL2_PINMUX(0, 0, 112, 7, 0, 0)
#define PTD16_LPUART8_TX_I                     NXP_SIUL2_PINMUX(0, 0, 112, 0, 409, 2)
#define PTF20_LPUART8_TX_O                     NXP_SIUL2_PINMUX(0, 0, 180, 1, 0, 0)
#define PTF20_LPUART8_TX_I                     NXP_SIUL2_PINMUX(0, 0, 180, 0, 409, 3)
#define PTF21_LPUART8_RX                       NXP_SIUL2_PINMUX(0, 0, 181, 0, 195, 3)
#define PTH6_LPUART8_TX_O                      NXP_SIUL2_PINMUX(0, 0, 230, 1, 0, 0)
#define PTH6_LPUART8_TX_I                      NXP_SIUL2_PINMUX(0, 0, 230, 0, 409, 4)
#define PTH7_LPUART8_RX                        NXP_SIUL2_PINMUX(0, 0, 231, 0, 195, 4)

/* LPUART7 */
#define PTB14_LPUART7_RX                       NXP_SIUL2_PINMUX(0, 0, 46, 0, 194, 1)
#define PTB15_LPUART7_TX_O                     NXP_SIUL2_PINMUX(0, 0, 47, 6, 0, 0)
#define PTB15_LPUART7_TX_I                     NXP_SIUL2_PINMUX(0, 0, 47, 0, 370, 1)
#define PTC19_LPUART7_TX_O                     NXP_SIUL2_PINMUX(0, 0, 83, 1, 0, 0)
#define PTC19_LPUART7_TX_I                     NXP_SIUL2_PINMUX(0, 0, 83, 0, 370, 2)
#define PTC20_LPUART7_RX                       NXP_SIUL2_PINMUX(0, 0, 84, 0, 194, 4)
#define PTE0_LPUART7_RX                        NXP_SIUL2_PINMUX(0, 0, 128, 0, 194, 2)
#define PTE1_LPUART7_TX_O                      NXP_SIUL2_PINMUX(0, 0, 129, 6, 0, 0)
#define PTE1_LPUART7_TX_I                      NXP_SIUL2_PINMUX(0, 0, 129, 0, 370, 3)
#define PTF18_LPUART7_TX_O                     NXP_SIUL2_PINMUX(0, 0, 178, 1, 0, 0)
#define PTF18_LPUART7_TX_I                     NXP_SIUL2_PINMUX(0, 0, 178, 0, 370, 4)
#define PTF19_LPUART7_RX                       NXP_SIUL2_PINMUX(0, 0, 179, 0, 194, 3)

/* PG */
#define PTB15_EXTWAKE                          NXP_SIUL2_PINMUX(0, 0, 47, 8, 0, 0)
#define PTB16_PGOOD                            NXP_SIUL2_PINMUX(0, 0, 48, 0, 440, 2)

/* LPUART13 */
#define PTB18_LPUART13_TX_O                    NXP_SIUL2_PINMUX(0, 0, 50, 1, 0, 0)
#define PTB18_LPUART13_TX_I                    NXP_SIUL2_PINMUX(0, 0, 50, 0, 414, 1)
#define PTB19_LPUART13_RX                      NXP_SIUL2_PINMUX(0, 0, 51, 0, 200, 1)
#define PTC26_LPUART13_TX_O                    NXP_SIUL2_PINMUX(0, 0, 90, 1, 0, 0)
#define PTC26_LPUART13_TX_I                    NXP_SIUL2_PINMUX(0, 0, 90, 0, 414, 2)
#define PTC27_LPUART13_RX                      NXP_SIUL2_PINMUX(0, 0, 91, 0, 200, 2)
#define PTG0_LPUART13_TX_O                     NXP_SIUL2_PINMUX(0, 0, 192, 1, 0, 0)
#define PTG0_LPUART13_TX_I                     NXP_SIUL2_PINMUX(0, 0, 192, 0, 414, 3)
#define PTG1_LPUART13_RX                       NXP_SIUL2_PINMUX(0, 0, 193, 0, 200, 3)

/* LPUART14 */
#define PTB20_LPUART14_TX_O                    NXP_SIUL2_PINMUX(0, 0, 52, 1, 0, 0)
#define PTB20_LPUART14_TX_I                    NXP_SIUL2_PINMUX(0, 0, 52, 0, 415, 1)
#define PTB21_LPUART14_RX                      NXP_SIUL2_PINMUX(0, 0, 53, 0, 201, 1)
#define PTD26_LPUART14_TX_O                    NXP_SIUL2_PINMUX(0, 0, 122, 1, 0, 0)
#define PTD26_LPUART14_TX_I                    NXP_SIUL2_PINMUX(0, 0, 122, 0, 415, 2)
#define PTD27_LPUART14_RX                      NXP_SIUL2_PINMUX(0, 0, 123, 0, 201, 2)
#define PTG2_LPUART14_TX_O                     NXP_SIUL2_PINMUX(0, 0, 194, 1, 0, 0)
#define PTG2_LPUART14_TX_I                     NXP_SIUL2_PINMUX(0, 0, 194, 0, 415, 3)
#define PTG3_LPUART14_RX                       NXP_SIUL2_PINMUX(0, 0, 195, 0, 201, 3)

/* LPUART15 */
#define PTB25_LPUART15_TX_O                    NXP_SIUL2_PINMUX(0, 0, 57, 1, 0, 0)
#define PTB25_LPUART15_TX_I                    NXP_SIUL2_PINMUX(0, 0, 57, 0, 416, 1)
#define PTB26_LPUART15_RX                      NXP_SIUL2_PINMUX(0, 0, 58, 0, 202, 1)
#define PTD28_LPUART15_TX_O                    NXP_SIUL2_PINMUX(0, 0, 124, 1, 0, 0)
#define PTD28_LPUART15_TX_I                    NXP_SIUL2_PINMUX(0, 0, 124, 0, 416, 2)
#define PTD29_LPUART15_RX                      NXP_SIUL2_PINMUX(0, 0, 125, 0, 202, 2)
#define PTG4_LPUART15_TX_O                     NXP_SIUL2_PINMUX(0, 0, 196, 1, 0, 0)
#define PTG4_LPUART15_TX_I                     NXP_SIUL2_PINMUX(0, 0, 196, 0, 416, 3)
#define PTG5_LPUART15_RX                       NXP_SIUL2_PINMUX(0, 0, 197, 0, 202, 3)

/* LPUART5 */
#define PTB27_LPUART5_TX_O                     NXP_SIUL2_PINMUX(0, 0, 59, 1, 0, 0)
#define PTB27_LPUART5_TX_I                     NXP_SIUL2_PINMUX(0, 0, 59, 0, 368, 3)
#define PTB28_LPUART5_RX                       NXP_SIUL2_PINMUX(0, 0, 60, 0, 192, 4)
#define PTD0_LPUART5_RX                        NXP_SIUL2_PINMUX(0, 0, 96, 0, 192, 2)
#define PTD1_LPUART5_TX_O                      NXP_SIUL2_PINMUX(0, 0, 97, 1, 0, 0)
#define PTD1_LPUART5_TX_I                      NXP_SIUL2_PINMUX(0, 0, 97, 0, 368, 1)
#define PTE3_LPUART5_RX                        NXP_SIUL2_PINMUX(0, 0, 131, 0, 192, 1)
#define PTE14_LPUART5_TX_O                     NXP_SIUL2_PINMUX(0, 0, 142, 4, 0, 0)
#define PTE14_LPUART5_TX_I                     NXP_SIUL2_PINMUX(0, 0, 142, 0, 368, 2)
#define PTF0_LPUART5_TX_O                      NXP_SIUL2_PINMUX(0, 0, 160, 1, 0, 0)
#define PTF0_LPUART5_TX_I                      NXP_SIUL2_PINMUX(0, 0, 160, 0, 368, 4)
#define PTF1_LPUART5_RX                        NXP_SIUL2_PINMUX(0, 0, 161, 0, 192, 3)

/* CAN3 */
#define PTC0_CAN3_TX                           NXP_SIUL2_PINMUX(0, 0, 64, 1, 0, 0)
#define PTC1_CAN3_RX                           NXP_SIUL2_PINMUX(0, 0, 65, 0, 3, 2)
#define PTC28_CAN3_TX                          NXP_SIUL2_PINMUX(0, 0, 92, 1, 0, 0)
#define PTC29_CAN3_RX                          NXP_SIUL2_PINMUX(0, 0, 93, 0, 3, 3)
#define PTD15_CAN3_RX                          NXP_SIUL2_PINMUX(0, 0, 111, 0, 3, 1)
#define PTE9_CAN3_TX                           NXP_SIUL2_PINMUX(0, 0, 137, 4, 0, 0)
#define PTE28_CAN3_TX                          NXP_SIUL2_PINMUX(0, 0, 156, 1, 0, 0)
#define PTE29_CAN3_RX                          NXP_SIUL2_PINMUX(0, 0, 157, 0, 3, 4)
#define PTF29_CAN3_TX                          NXP_SIUL2_PINMUX(0, 0, 189, 1, 0, 0)
#define PTF30_CAN3_RX                          NXP_SIUL2_PINMUX(0, 0, 190, 0, 3, 5)

/* TRACE */
#define PTC0_TRACE_ETM_D0                      NXP_SIUL2_PINMUX(0, 0, 64, 11, 0, 0)
#define PTC1_TRACE_ETM_CLKOUT                  NXP_SIUL2_PINMUX(0, 0, 65, 12, 0, 0)
#define PTC2_TRACE_ETM_CLKOUT                  NXP_SIUL2_PINMUX(0, 0, 66, 6, 0, 0)
#define PTC17_TRACE_ETM_D3                     NXP_SIUL2_PINMUX(0, 0, 81, 13, 0, 0)
#define PTD7_TRACE_ETM_D0                      NXP_SIUL2_PINMUX(0, 0, 103, 6, 0, 0)
#define PTD8_TRACE_ETM_D2                      NXP_SIUL2_PINMUX(0, 0, 104, 12, 0, 0)
#define PTD9_TRACE_ETM_D1                      NXP_SIUL2_PINMUX(0, 0, 105, 15, 0, 0)
#define PTD10_TRACE_ETM_D3                     NXP_SIUL2_PINMUX(0, 0, 106, 4, 0, 0)
#define PTD11_TRACE_ETM_D2                     NXP_SIUL2_PINMUX(0, 0, 107, 4, 0, 0)
#define PTD12_TRACE_ETM_D1                     NXP_SIUL2_PINMUX(0, 0, 108, 4, 0, 0)
#define PTF28_TRACE_ETM_D5                     NXP_SIUL2_PINMUX(0, 0, 188, 7, 0, 0)
#define PTF31_TRACE_ETM_D3                     NXP_SIUL2_PINMUX(0, 0, 191, 7, 0, 0)
#define PTG6_TRACE_ETM_CLKOUT                  NXP_SIUL2_PINMUX(0, 0, 198, 7, 0, 0)
#define PTG7_TRACE_ETM_D0                      NXP_SIUL2_PINMUX(0, 0, 199, 7, 0, 0)
#define PTG15_TRACE_ETM_D1                     NXP_SIUL2_PINMUX(0, 0, 207, 7, 0, 0)
#define PTG16_TRACE_ETM_D2                     NXP_SIUL2_PINMUX(0, 0, 208, 7, 0, 0)
#define PTG17_TRACE_ETM_D4                     NXP_SIUL2_PINMUX(0, 0, 209, 7, 0, 0)
#define PTG18_TRACE_ETM_D6                     NXP_SIUL2_PINMUX(0, 0, 210, 7, 0, 0)
#define PTG19_TRACE_ETM_D7                     NXP_SIUL2_PINMUX(0, 0, 211, 7, 0, 0)
#define PTG20_TRACE_ETM_D8                     NXP_SIUL2_PINMUX(0, 0, 212, 7, 0, 0)
#define PTG21_TRACE_ETM_D9                     NXP_SIUL2_PINMUX(0, 0, 213, 7, 0, 0)
#define PTG22_TRACE_ETM_D10                    NXP_SIUL2_PINMUX(0, 0, 214, 7, 0, 0)
#define PTG23_TRACE_ETM_D11                    NXP_SIUL2_PINMUX(0, 0, 215, 7, 0, 0)
#define PTG24_TRACE_ETM_D12                    NXP_SIUL2_PINMUX(0, 0, 216, 7, 0, 0)
#define PTG25_TRACE_ETM_D13                    NXP_SIUL2_PINMUX(0, 0, 217, 7, 0, 0)
#define PTG26_TRACE_ETM_D14                    NXP_SIUL2_PINMUX(0, 0, 218, 7, 0, 0)
#define PTG27_TRACE_ETM_D15                    NXP_SIUL2_PINMUX(0, 0, 219, 7, 0, 0)
#define PTG28_TRACE_ETM_D0                     NXP_SIUL2_PINMUX(0, 0, 220, 7, 0, 0)
#define PTG29_TRACE_ETM_D1                     NXP_SIUL2_PINMUX(0, 0, 221, 7, 0, 0)
#define PTG30_TRACE_ETM_D2                     NXP_SIUL2_PINMUX(0, 0, 222, 7, 0, 0)
#define PTG31_TRACE_ETM_D3                     NXP_SIUL2_PINMUX(0, 0, 223, 7, 0, 0)
#define PTH0_TRACE_ETM_D4                      NXP_SIUL2_PINMUX(0, 0, 224, 7, 0, 0)
#define PTH1_TRACE_ETM_D5                      NXP_SIUL2_PINMUX(0, 0, 225, 7, 0, 0)
#define PTH2_TRACE_ETM_D6                      NXP_SIUL2_PINMUX(0, 0, 226, 7, 0, 0)
#define PTH3_TRACE_ETM_D7                      NXP_SIUL2_PINMUX(0, 0, 227, 7, 0, 0)
#define PTH4_TRACE_ETM_CLKOUT                  NXP_SIUL2_PINMUX(0, 0, 228, 7, 0, 0)
#define PTH5_TRACE_ETM_D8                      NXP_SIUL2_PINMUX(0, 0, 229, 7, 0, 0)
#define PTH6_TRACE_ETM_D9                      NXP_SIUL2_PINMUX(0, 0, 230, 7, 0, 0)
#define PTH7_TRACE_ETM_D10                     NXP_SIUL2_PINMUX(0, 0, 231, 7, 0, 0)
#define PTH8_TRACE_ETM_D11                     NXP_SIUL2_PINMUX(0, 0, 232, 7, 0, 0)
#define PTH9_TRACE_ETM_D12                     NXP_SIUL2_PINMUX(0, 0, 233, 7, 0, 0)
#define PTH10_TRACE_ETM_D13                    NXP_SIUL2_PINMUX(0, 0, 234, 7, 0, 0)
#define PTH11_TRACE_ETM_D14                    NXP_SIUL2_PINMUX(0, 0, 235, 7, 0, 0)
#define PTH12_TRACE_ETM_D15                    NXP_SIUL2_PINMUX(0, 0, 236, 7, 0, 0)

