zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K358_K348_K338_K328_289BGA-pinctrl.h
/* LPI2C1 */
#define PTC5_LPI2C1_HREQ                       NXP_SIUL2_PINMUX(0, 0, 69, 0, 216, 2)
#define PTC6_LPI2C1_SDA_O                      NXP_SIUL2_PINMUX(0, 0, 70, 1, 0, 0)
#define PTC6_LPI2C1_SDA_I                      NXP_SIUL2_PINMUX(0, 0, 70, 0, 219, 2)
#define PTC7_LPI2C1_SCL_O                      NXP_SIUL2_PINMUX(0, 0, 71, 3, 0, 0)
#define PTC7_LPI2C1_SCL_I                      NXP_SIUL2_PINMUX(0, 0, 71, 0, 217, 1)
#define PTC15_LPI2C1_SCL_O                     NXP_SIUL2_PINMUX(0, 0, 79, 7, 0, 0)
#define PTC15_LPI2C1_SCL_I                     NXP_SIUL2_PINMUX(0, 0, 79, 0, 217, 6)
#define PTC16_LPI2C1_SDAS_O                    NXP_SIUL2_PINMUX(0, 0, 80, 4, 0, 0)
#define PTC16_LPI2C1_SDA_O                     NXP_SIUL2_PINMUX(0, 0, 80, 7, 0, 0)
#define PTC16_LPI2C1_SDA_I                     NXP_SIUL2_PINMUX(0, 0, 80, 0, 219, 5)
#define PTC16_LPI2C1_SDAS_I                    NXP_SIUL2_PINMUX(0, 0, 80, 0, 220, 1)
#define PTC17_LPI2C1_SCLS_O                    NXP_SIUL2_PINMUX(0, 0, 81, 4, 0, 0)
#define PTC17_LPI2C1_SCLS_I                    NXP_SIUL2_PINMUX(0, 0, 81, 0, 218, 2)
#define PTC28_LPI2C1_SCL_O                     NXP_SIUL2_PINMUX(0, 0, 92, 5, 0, 0)
#define PTC28_LPI2C1_SCL_I                     NXP_SIUL2_PINMUX(0, 0, 92, 0, 217, 4)
#define PTC29_LPI2C1_SDA_O                     NXP_SIUL2_PINMUX(0, 0, 93, 5, 0, 0)
#define PTC29_LPI2C1_SDA_I                     NXP_SIUL2_PINMUX(0, 0, 93, 0, 219, 3)
#define PTD8_LPI2C1_SDA_O                      NXP_SIUL2_PINMUX(0, 0, 104, 2, 0, 0)
#define PTD8_LPI2C1_SDA_I                      NXP_SIUL2_PINMUX(0, 0, 104, 0, 219, 1)
#define PTD9_LPI2C1_SCL_O                      NXP_SIUL2_PINMUX(0, 0, 105, 2, 0, 0)
#define PTD9_LPI2C1_SCL_I                      NXP_SIUL2_PINMUX(0, 0, 105, 0, 217, 2)
#define PTD12_LPI2C1_HREQ                      NXP_SIUL2_PINMUX(0, 0, 108, 0, 216, 1)
#define PTF7_LPI2C1_SCL_O                      NXP_SIUL2_PINMUX(0, 0, 167, 3, 0, 0)
#define PTF7_LPI2C1_SCL_I                      NXP_SIUL2_PINMUX(0, 0, 167, 0, 217, 5)
#define PTF8_LPI2C1_SDA_O                      NXP_SIUL2_PINMUX(0, 0, 168, 3, 0, 0)
#define PTF8_LPI2C1_SDA_I                      NXP_SIUL2_PINMUX(0, 0, 168, 0, 219, 4)

/* CAN2 */
#define PTC6_CAN2_RX                           NXP_SIUL2_PINMUX(0, 0, 70, 0, 2, 6)
#define PTC7_CAN2_TX                           NXP_SIUL2_PINMUX(0, 0, 71, 7, 0, 0)
#define PTC14_CAN2_RX                          NXP_SIUL2_PINMUX(0, 0, 78, 0, 2, 2)
#define PTC15_CAN2_TX                          NXP_SIUL2_PINMUX(0, 0, 79, 1, 0, 0)
#define PTC16_CAN2_RX                          NXP_SIUL2_PINMUX(0, 0, 80, 0, 2, 1)
#define PTC17_CAN2_TX                          NXP_SIUL2_PINMUX(0, 0, 81, 3, 0, 0)
#define PTD18_CAN2_TX                          NXP_SIUL2_PINMUX(0, 0, 114, 1, 0, 0)
#define PTD19_CAN2_RX                          NXP_SIUL2_PINMUX(0, 0, 115, 0, 2, 4)
#define PTE24_CAN2_TX                          NXP_SIUL2_PINMUX(0, 0, 152, 3, 0, 0)
#define PTE25_CAN2_RX                          NXP_SIUL2_PINMUX(0, 0, 153, 0, 2, 3)
#define PTF25_CAN2_TX                          NXP_SIUL2_PINMUX(0, 0, 185, 1, 0, 0)
#define PTF26_CAN2_RX                          NXP_SIUL2_PINMUX(0, 0, 186, 0, 2, 5)

/* CAN5 */
#define PTC10_CAN5_TX                          NXP_SIUL2_PINMUX(0, 0, 74, 3, 0, 0)
#define PTC11_CAN5_RX                          NXP_SIUL2_PINMUX(0, 0, 75, 0, 5, 2)
#define PTC26_CAN5_RX                          NXP_SIUL2_PINMUX(0, 0, 90, 0, 5, 5)
#define PTC27_CAN5_TX                          NXP_SIUL2_PINMUX(0, 0, 91, 1, 0, 0)
#define PTD17_CAN5_RX                          NXP_SIUL2_PINMUX(0, 0, 113, 0, 5, 1)
#define PTE12_CAN5_TX                          NXP_SIUL2_PINMUX(0, 0, 140, 2, 0, 0)
#define PTF4_CAN5_TX                           NXP_SIUL2_PINMUX(0, 0, 164, 1, 0, 0)
#define PTF5_CAN5_RX                           NXP_SIUL2_PINMUX(0, 0, 165, 0, 5, 3)
#define PTG13_CAN5_TX                          NXP_SIUL2_PINMUX(0, 0, 205, 1, 0, 0)
#define PTG14_CAN5_RX                          NXP_SIUL2_PINMUX(0, 0, 206, 0, 5, 4)

/* LPUART10 */
#define PTC12_LPUART10_RX                      NXP_SIUL2_PINMUX(0, 0, 76, 0, 197, 2)
#define PTC13_LPUART10_TX_O                    NXP_SIUL2_PINMUX(0, 0, 77, 1, 0, 0)
#define PTC13_LPUART10_TX_I                    NXP_SIUL2_PINMUX(0, 0, 77, 0, 411, 1)
#define PTE2_LPUART10_RX                       NXP_SIUL2_PINMUX(0, 0, 130, 0, 197, 1)
#define PTE6_LPUART10_TX_O                     NXP_SIUL2_PINMUX(0, 0, 134, 5, 0, 0)
#define PTE6_LPUART10_TX_I                     NXP_SIUL2_PINMUX(0, 0, 134, 0, 411, 2)
#define PTF12_LPUART10_TX_O                    NXP_SIUL2_PINMUX(0, 0, 172, 1, 0, 0)
#define PTF12_LPUART10_TX_I                    NXP_SIUL2_PINMUX(0, 0, 172, 0, 411, 3)
#define PTF13_LPUART10_RX                      NXP_SIUL2_PINMUX(0, 0, 173, 0, 197, 3)
#define PTH8_LPUART10_TX_O                     NXP_SIUL2_PINMUX(0, 0, 232, 1, 0, 0)
#define PTH8_LPUART10_TX_I                     NXP_SIUL2_PINMUX(0, 0, 232, 0, 411, 4)
#define PTH9_LPUART10_RX                       NXP_SIUL2_PINMUX(0, 0, 233, 0, 197, 4)

/* CAN6 */
#define PTC21_CAN6_TX                          NXP_SIUL2_PINMUX(0, 0, 85, 7, 0, 0)
#define PTC23_CAN6_RX                          NXP_SIUL2_PINMUX(0, 0, 87, 0, 417, 1)
#define PTD28_CAN6_TX                          NXP_SIUL2_PINMUX(0, 0, 124, 7, 0, 0)
#define PTD29_CAN6_RX                          NXP_SIUL2_PINMUX(0, 0, 125, 0, 417, 2)
#define PTG20_CAN6_TX                          NXP_SIUL2_PINMUX(0, 0, 212, 6, 0, 0)
#define PTG21_CAN6_RX                          NXP_SIUL2_PINMUX(0, 0, 213, 0, 417, 3)
#define PTH0_CAN6_TX                           NXP_SIUL2_PINMUX(0, 0, 224, 1, 0, 0)
#define PTH1_CAN6_RX                           NXP_SIUL2_PINMUX(0, 0, 225, 0, 417, 4)

/* LPUART12 */
#define PTC24_LPUART12_TX_O                    NXP_SIUL2_PINMUX(0, 0, 88, 1, 0, 0)
#define PTC24_LPUART12_TX_I                    NXP_SIUL2_PINMUX(0, 0, 88, 0, 413, 1)
#define PTC25_LPUART12_RX                      NXP_SIUL2_PINMUX(0, 0, 89, 0, 199, 2)
#define PTE4_LPUART12_TX_O                     NXP_SIUL2_PINMUX(0, 0, 132, 5, 0, 0)
#define PTE4_LPUART12_TX_I                     NXP_SIUL2_PINMUX(0, 0, 132, 0, 413, 2)
#define PTE5_LPUART12_RX                       NXP_SIUL2_PINMUX(0, 0, 133, 0, 199, 1)
#define PTF16_LPUART12_TX_O                    NXP_SIUL2_PINMUX(0, 0, 176, 1, 0, 0)
#define PTF16_LPUART12_TX_I                    NXP_SIUL2_PINMUX(0, 0, 176, 0, 413, 3)
#define PTF17_LPUART12_RX                      NXP_SIUL2_PINMUX(0, 0, 177, 0, 199, 3)
#define PTG24_LPUART12_TX_O                    NXP_SIUL2_PINMUX(0, 0, 216, 1, 0, 0)
#define PTG24_LPUART12_TX_I                    NXP_SIUL2_PINMUX(0, 0, 216, 0, 413, 4)
#define PTG25_LPUART12_RX                      NXP_SIUL2_PINMUX(0, 0, 217, 0, 199, 4)

