zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K358_K348_K338_K328_289BGA-pinctrl.h
/* CAN7 */
#define PTC24_CAN7_TX                          NXP_SIUL2_PINMUX(0, 0, 88, 5, 0, 0)
#define PTC25_CAN7_RX                          NXP_SIUL2_PINMUX(0, 0, 89, 0, 418, 1)
#define PTD30_CAN7_TX                          NXP_SIUL2_PINMUX(0, 0, 126, 7, 0, 0)
#define PTD31_CAN7_RX                          NXP_SIUL2_PINMUX(0, 0, 127, 0, 418, 2)
#define PTG26_CAN7_TX                          NXP_SIUL2_PINMUX(0, 0, 218, 6, 0, 0)
#define PTG27_CAN7_RX                          NXP_SIUL2_PINMUX(0, 0, 219, 0, 418, 3)
#define PTH2_CAN7_TX                           NXP_SIUL2_PINMUX(0, 0, 226, 1, 0, 0)
#define PTH3_CAN7_RX                           NXP_SIUL2_PINMUX(0, 0, 227, 0, 418, 4)

/* SAI1 */
#define PTD13_SAI1_D0_O                        NXP_SIUL2_PINMUX(0, 0, 109, 6, 0, 0)
#define PTD13_SAI1_D0_I                        NXP_SIUL2_PINMUX(0, 0, 109, 0, 323, 1)
#define PTD14_SAI1_MCLK                        NXP_SIUL2_PINMUX(0, 0, 110, 0, 324, 1)
#define PTD15_SAI1_SYNC_O                      NXP_SIUL2_PINMUX(0, 0, 111, 6, 0, 0)
#define PTD15_SAI1_SYNC_I                      NXP_SIUL2_PINMUX(0, 0, 111, 0, 325, 1)
#define PTE3_SAI1_D0_O                         NXP_SIUL2_PINMUX(0, 0, 131, 2, 0, 0)
#define PTE3_SAI1_D0_I                         NXP_SIUL2_PINMUX(0, 0, 131, 0, 323, 2)
#define PTE8_SAI1_BCLK_O                       NXP_SIUL2_PINMUX(0, 0, 136, 6, 0, 0)
#define PTE8_SAI1_BCLK_I                       NXP_SIUL2_PINMUX(0, 0, 136, 0, 322, 1)
#define PTE12_SAI1_MCLK                        NXP_SIUL2_PINMUX(0, 0, 140, 0, 324, 2)

#endif /* HAL_NXP_DTS_NXP_S32_S32K358_K348_K338_K328_289BGA_PINCTRL_H_ */
